{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1876,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Predictive analytics and machine learning for preventing system failures and degradation",
      "description": "<p> This project focuses on leveraging predictive analytics and machine learning techniques to anticipate and prevent potential failures or disruptions. By analyzing historical data and patterns, the project aims to develop algorithms that can provide insights and furthermore predict when components or systems might fail or experience performance degradation. This would enable proactive maintenance, minimize downtime, and enhance overall reliability and availability.</p><p> Preprocess the dataset to ensure consistency and remove any noise or outliers. This may involve data ETL, cleaning, normalization, and feature engineering. Choose relevant algorithms and models such as regression, classification, clustering, dimensionality reduction, decision trees, support vector machines, k-means clustering, and principal component analysis. Develop software that would analyze real-time data and suggest failure prediction scores. PL/SQL, Python (SciPy, NumPy, DataFrames, Lambda, ML packages), Spark-QL, R Technical proficiency, Strong learning curve, Teamwork, Innovation, and attention to detail. Efficient execution would reward in deep understanding of industry-level problems, specifically for the evaluation of design choices in data science problems. Statistics, Mathematics, Python, Basics of data science.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1877,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Bot Framework for Cloud Databases",
      "description": "<p> Along the lines of AskEd/AskDebbie, we are proposing to build a base framework that can be used for building component-specific bots for various areas like networking, infrapatching, provisioning etc. The proposal is to use and improvise the current bots and to build a framework into which additional bots can be plugged in.</p><p> These bots can come in internal/external variations – we have lots of information spread across various places like public product documentation, confluence pages, runbooks, support notes, JIRAs, slack channels, etc for product components. These bots can scrap that information and make it available for internal or external usage and make it easier for field facing teams to resolve issues or complete deployments faster. AI/ML, chatbots, python, node.js, slack integrations. Self-learner who is interested in exploring and implementing improvements. AI/ML area, cloud databases, Automation Any course available on building chatbots.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1878,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "\"Tenacious, Proactive, Independent, Collaborative\"",
      "description": "<p> This project aims to develop and deploy a prompt format grammar framework for testing and evaluating diverse prompt structures. Through systematic assessment, we seek to identify optimal prompt formats for comprehensive testing purposes. Following the implementation phase, a thorough evaluation of the prompt designs needs to be conducted to gather insights and refine the framework. Ultimately, the project will deliver actionable feedback to developers, facilitating iterative improvements in prompt design and testing methodologies.</p><p> Ref: QUANTIFYING LANGUAGE MODELS’ SENSITIVITY TO SPURIOUS FEATURES IN PROMPT DESIGN 1. Proficient in algorithms and data structures</p><p> 2. Proficient in programming and software development in Python, C/C++, Java (at least 1)</p><p> 3. Familiar with machine learning techniques and frameworks</p><p> 4. Familiar with natural language processing (NLP)</p><p> 5. Proficient in SQL and basic database schema management and operation (preferred)</p><p> 6. Possesses excellent oral and written communication skills Tenacious, Proactive,</p><p> Independent, Collaborative 1. Exposure to state-of-the-art software engineering practices</p><p> 2. Exposure to working with a global team in India, USA, and Mexico</p><p> 3. Development and evaluation of machine learning algorithms</p><p> 4. Learn to fine-tune deep learning models</p><p> 5. Develop a feedback system to improve the selection of features for the algorithms =HYPERLINK(\"https://www.bits-pilani.ac.in/dubai/computer-science-information-systems/courses/\";\"Core Courses:</p><p> CS F211 Data Structures &amp; Algorithms</p><p> CS F212 Database Systems</p><p> CS F364 Design &amp; Analysis of Algorithms</p><p> </p><p> Specialization (any 2):</p><p> BITS F311 Image Pr</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1879,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Config Management and Recommendation Service (CMRS)",
      "description": "<p> CMRS is a cloud database service using which customers can create database configurations and apply them across the enterprise based on tags. CMRS provides recommendations for fixing changes that could impact cloud automation, maintenance, security/compliance, performance, and utilization. CMS can also be used for fleet wide centralized view of various resources, their status, and associated configuration values. CMS will significantly reduce operational and maintenance tasks for customers. </p><p> Building a Config Management service that will be integrated with DB Cloud services. Java, J2EE, Collections, REST API, Docker Container, Maven, Terraform Logical thinking, Quick Learner, hard-working, ability to work independently and team player Java, J2EE, Micro Services architecture, Distributed Systems, Cloud Services, CI/CD pipeline The foundation of cloud services (compute, networking, block storage, database), microservices architecture, and basics of database.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1880,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "AI/ML-driven Autonomous Exploratory Test (ET) development for the Oracle Cloud Database",
      "description": "<p> For all bugs found by Exploratory Test (ET) tests running daily, we have the workload associated with these bugs i.e. a file containing the SQL workload sequence which caused the corresponding bug. We want these audited workloads to train a machine learning model and let it recommend more useful test sequences among the random ones. </p><p> Recommendation of such test sequences, having a higher probability of finding new bugs, will be extremely beneficial for the quality of the Oracle Cloud Database. By using a suitable machine learning algorithm, we want to improve the efficiency of the exploratory testing framework by controlling the randomization, so that it works in our favor and hits the path that is more bug-producible. </p><p> This project has the flavor of a research project where we discover the best solution through our journey of building the model. So, this way, there is flexibility in choosing any type of ML we want to use (Supervised/Unsupervised), any type of classifier we want to use (SVM/KNN/Naive Bayes/Deep learning etc.), whichever helps us achieve the objective of this project. Here is a quick overview of machine learning and how it would be beneficial to achieve our goal.</p><p> Why Machine Learning is beneficial to this project: </p><p> As described above, we have already filed considerable amounts of ET bugs and thus we have a lot of audited workloads. These audits would essentially contain all the steps to recreate the original bug, like some DDLs (create/drop of objects like table/view/MV) and/or DMLs (insert/delete/merge data) and/or select queries, etc. This gives us our dataset to begin the work with.</p><p> We can analyse the dataset and make use of this in our machine learning algorithm by simply training the ML model on this dataset (of course data cleaning would be required first) to recommend which random SQL workload sequences are more prone to finding new code bugs. • Must Have Skills:</p><p> (1) Basic Machine Learning Knowledge</p><p> (2) Machine Learning Classification Algorithms</p><p> (3) Python 3.x</p><p> (4) Python Modules/Libraries</p><p> • Desirable Skills:</p><p> (1) Linux</p><p> (2) PL/SQL • Strong Foundation in software engineering principles.</p><p> • Good understanding of Python programming language.</p><p> • Hands on experience on Machine/Deep Learning projects.</p><p> • RDBMS (Relational Database Management System) and SQL knowledge is strongly desirable.</p><p> • Excellent problem-solving skills and attention to detail. The intern gets hands-on experience exploring Machine / Deep learning and an extremely powerful tool like ET along with a behind-the-scenes view of all its features and capabilities. They also get valuable programming/scripting experience and get to apply their ML knowledge in an industry setting. • Python Course including:</p><p> 1. NumPy for mathematical operations</p><p> 2. Pandas for file operations.</p><p> 3. Scikit-Learn for classification and regression algorithms etc.</p><p> • Basic ML/Deep Learning Courses.</p><p> • Basic SQL, PL/SQL, Linux Courses.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1881,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Tokenization Server",
      "description": "<p> For security, organizations must securely maintain sensitive data like Aadhar, PAN and VoterIDs. </p><p> Transforming data into a representation or “token” is tokenization. De-tokenization is the reverse, recovering the original data from its “token”. Tokenization reduces exposure of sensitive data; and helps address data residency and compliance requirements.</p><p> A Tokenization system has several components to generate tokens, store mappings, provide authorized and authenticated access, encrypt storage and interfaces to fetch and create tokens. This project will add tokenization to Oracle Key Vault with features to securely store and transmit tokens, encrypt the mapping store, and build interfaces to generate and fetch tokens. Security, Encryption, System Design, C, Scripting language like Bash GPA: 8.0 and higher Tokenization, Design for Scale Security or Network Security</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1882,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Implement security assessment checks and recommendations for databases",
      "description": "<p> Oracle Database Security Assessment Tool (DBSAT) is an extremely popular and easy-to-use tool to help our customers collect hundreds of security configuration information from Oracle databases. Based on the collected information, it evaluates the current security state and provides recommendations on how to mitigate the identified risks. DBSAT checks and recommendations are also embedded into Data Safe (Security Assessment), and Audit Vault and Database Firewall (Database Security Posture Management).</p><p> This project proposes to collect similar security configuration information and implement security checks and mitigation recommendations for other popular commercial and open-source databases. Security, Databases, commands and shell scripts Security concept, Inquisitiveness, Exploratory mindset Security benchmarks, Security concepts in databases Databases, Security</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1883,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "User behavioral Analytics (UBA) for Databases",
      "description": "<p> Oracle Audit Vault and Database Firewall (AVDF) supports native database audit data collection and network-based SQL monitoring to deliver a comprehensive Database Activity Monitoring (DAM) solution and helps to manage customers Database Security Posture Management (DSPM).</p><p> </p><p> Monitoring the activities of privileged users and detecting anomalies is one of the key use cases, but today, one has to configure policies manually for such a detection. The aim of this project is to understand the activities carried out by privileged users and auto-detect any anomalies in them using machine learning, and other techniques. Database knowledge, SQL,, Data Structures and C++ programming Quick and fast learner. Anomaly detection. Database knowledge, SQL</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1884,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Autonomous Database Dedicated Cloud Service Management User Interface with Integrated Digital Assistant, AI-Generated Runbooks, and Autonomous Corrective Action",
      "description": "<p> Oracle Autonomous Database is the world’s first autonomous data management in the cloud to deliver automated patching, upgrades, and tuning—including performing all routine database maintenance tasks while the system is running - without human intervention. This new autonomous database cloud is self-managing, self-securing, and self-repairing, which helps to eliminate manual database management and human errors.</p><p> Oracle Autonomous Database Dedicated offers a private cloud in the public cloud - a completely dedicated compute, storage, network, and database service for only a single tenant. This offers a multitenant database architecture, allowing you to create and manage multiple Autonomous Databases within a single database system. </p><p> The Autonomous Database Cloud Service Management User Interface project aims to create a comprehensive platform for effectively overseeing the Autonomous Database Cloud Service. This platform will act as a central hub for service engineers to monitor, troubleshoot, and optimize this cloud infrastructure. Alongside featuring an integrated digital assistant and AI-generated runbooks, the system will incorporate autonomous corrective action capabilities. This innovative feature will empower the platform to automatically detect and resolve common issues or anomalies within this cloud service, leveraging advanced algorithms and predefined rules. By seamlessly integrating autonomous corrective actions with AI-generated runbooks, the platform ensures swift issue resolution, minimizing downtime, and enhancing operational efficiency in the cloud environment. The platform will also aid operations personnel in debugging/root-causing challenging issues by suggesting corrective actions derived from a heuristics bank populated with AI-generated data from historical triaging activity. Familiarity with natural language processing (NLP) and conversational AI technologies</p><p> • Working knowledge of machine learning and generative AI models</p><p> • Familiarity with statistical analysis and forecasting techniques</p><p> • Proficiency in Java and Python programming languages for backend development</p><p> • Experience with Oracle SQL for database management and querying</p><p> •Familiarity with Docker containerization for deployment and management of applications</p><p> • Knowledge of Kubernetes for container orchestration and management in cloud environments Analytical Thinking: Capacity to analyze historical data, interpret forecasting insights, and troubleshoot technical issues</p><p> Innovation: Ability to devise creative solutions for enhancing forecasting accuracy, optimizing resource allocation, and improving overall platform functionality.</p><p> Collaboration: Willingness to work collaboratively with cross-functional teams to integrate forecasting capabilities seamlessly and ensure alignment with broader project goals.</p><p> Communication: Effective communication skills to convey technical concepts, forecasting insights, and recommendations clearly and concisely to stakeholders at all levels. Deeper understanding of forecasting techniques and algorithms for predicting future resource usage.</p><p> Enhanced skills in developing AI-generated runbooks tailored for Autonomous Database Cloud service management.</p><p> Improved knowledge of statistical analysis methods for interpreting forecasting results and making informed decisions. Database Management</p><p> Forecasting Methods and Applications</p><p> Machine Learning for Developers: </p><p> Statistical Analysis with Python: to interpret forecasting results effectively.</p><p> Proficiency in programming languages such as Python or Bash for automation of tasks related to cloud service management, including forecasting.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1885,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Cloud DB Backup Recommendations and Estimations",
      "description": "<p> In the realm of data management, ensuring the integrity, security, and availability of databases is paramount. Database backups play a crucial role in safeguarding against data loss due to various factors such as hardware failures, software glitches, cyberattacks, or human errors. Today, Oracle offers Managed Database Services such as Base Database Cloud Service and Exadata Cloud Service as part of Oracle Cloud. This project aims to leverage machine learning techniques to add a layer of value to Oracle Database Cloud Service customers regarding -</p><p> &nbsp;Estimated time taken to complete their backups</p><p> &nbsp;Backup window recommendations</p><p> &nbsp;Estimated total size of backups for the recovery window</p><p> &nbsp;VM Resource Usage Prediction Java, Python, and Linux fundamentals</p><p> Git and version control basics</p><p> Machine learning and statistics You should be able to apply your knowledge of Machine Learning theory and model it with real-world considerations</p><p> </p><p> Ability to analyze data, identify patterns, and draw meaningful insights from large datasets.</p><p> Familiarity with various machine learning algorithms such as regression, classification, clustering, neural networks, and ensemble methods. Cloud fundamentals</p><p> Machine Learning Fundamentals</p><p> </p><p> Model Selection and Evaluation using metrics like mean absolute error, mean squared error, or other relevant metrics for regression tasks.</p><p> Deployment Considerations include scalability, latency, and model monitoring.</p><p> Communication Skills: How to effectively communicate to stakeholders with varying levels of technical expertise Relational Database Management Systems</p><p> Operating Systems</p><p> Machine Learning</p><p> Object Oriented Programming</p><p> Any additional AI/ML courses are a bonus</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1886,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Kafka-Based Real-Time Database Health Advisor",
      "description": "<p> This project proposes utilizing Kafka, an industry-standard message bus for distributed applications, to offload hang detection from the Database to external applications. This approach promises faster and more deterministic hang identification. Additionally, the infrastructure can be leveraged to offer Database health analysis, including memory usage and critical resource consumption.</p><p> It can be integrated into the Database to trigger alerts based on critical events in the Database logs. Furthermore, proactive measures can be implemented to prevent imminent hangs and identify activities that could compromise Database health.</p><p> The proposed solution involves the Database publishing the critical events to a Kafka bus. External applications subscribed to this bus will consume and analyse these events, drawing insights that can be published back to the Database as new events. The Database can then process these insights and take appropriate corrective actions. Data pushed to Kafka can be used for incremental training of ML models on streaming data. The project aims to:</p><p> § Enhance the robustness of the existing Kafka messaging infrastructure within the Database.</p><p> § Develop features to enable high-velocity (one million messages per second) publishing and consumption of Kafka messages.</p><p> § Construct applications within/outside the Database that function as health advisors, leveraging the Kafka infrastructure for real-time analysis and proactive management. Familiarity with Oracle database.</p><p> Experience with Kafka architecture, message production/consumption, and tooling</p><p> Understanding of distributed architectures and communication protocols</p><p> Good programming skills in C/Java/Python Analyse complex system behaviour.</p><p> </p><p> Critical thinking and problem-solving skills.</p><p> Exposure to system design, scalable and optimized solutions for real-world tasks.</p><p> Collaboration with others. A strong understanding of Kafka's capabilities and how to leverage them for building event-driven architectures.</p><p> Working with database metrics and logs and using them to analyse database health and gain insights into database performance.</p><p> Understanding distributed system concepts like message-queuing, scalability, and fault-tolerance. Coursework on Distributed Systems and Networking would be useful.</p><p> Understanding of Kafka fundamentals, and developing event-driven services are a plus, but are not mandatory to work on the project.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1887,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Tool to Analyze and Review Code and make recommendations",
      "description": "<p> Oracle Database has millions of lines of code, with thousands of lines of code added or updated every day. The functional test team ensures through automated tests that code regressions are not introduced with code changes.</p><p> The security test and tools development team has an initiative to map and analyze historical data (from previous defects, regression tickets, analysis of defects, and code coverage amongst others) and provide actionable recommendations for every code change. The idea is to improve automation and code quality through these recommendations before the code is merged. Oracle Database, UI development using Oracle APEX, PL/SQL, Data Mining, Testing, Documentation Quick learner, with a good understanding of PL/SQL &amp; JavaScript, invent and simplify complex problems. UI design and development, Oracle Database, Complex PL/SQL queries, SQL Tuning, Database Security concepts.</p><p> This would be an excellent opportunity for young engineers to understand Oracle Database, write complex queries, experience UI development, and process large data to create meaningful reports to create a tool that will be used by over 500 engineers at Oracle. PL/SQL, Oracle Apex</p><p> Data Mining</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1888,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Oracle Patch Planner",
      "description": "<p> In today's digital landscape, the importance of keeping systems up-to-date cannot be overstated. With cyber threats evolving rapidly, outdated systems become vulnerable targets for malicious attacks. Additionally, outdated systems often suffer from performance issues and compatibility constraints, hindering productivity and innovation. Therefore, the Oracle Patch Upgrade Framework is not only about staying current with the latest technology but also about safeguarding the integrity and security of customer systems. By empowering customers with personalized patch recommendations, detailed patching plans, and seamless upgrade options, this project aims to ensure that Oracle customers are well-equipped to navigate the ever-changing landscape of technology with confidence and resilience.</p><p> The Oracle Patch Planner is a comprehensive project aimed at modernizing the patching process for Oracle customers. It encompasses three major features: Patch Recommendation, Patch Plan, and Gold Image provisioning. Through these features, the framework offers personalized patch recommendations, detailed patching plans, and pre-configured Gold Images for seamless system upgrades. This project is pivotal in ensuring that customers maintain up-to-date and secure systems, thus safeguarding against security vulnerabilities, optimizing performance, and enhancing system stability. Proficiency in programming languages such as Python, Java, or C++</p><p> Understanding of system administration and patch management concepts</p><p> Strong problem-solving and analytical skills</p><p> Ability to work collaboratively in a team environment</p><p> Excellent communication and presentation skills Attention to Detail: Ensuring accuracy and precision in patch recommendations and deployment processes</p><p> Customer-Centric Approach: Prioritizing customer needs and satisfaction throughout the project lifecycle</p><p> Proactive Mindset: Anticipating potential challenges and addressing them proactively</p><p> Team Player: Collaborating effectively with team members to achieve project goals Gain hands-on experience in system administration and patch management best practices</p><p> Understand the importance of customer experience and satisfaction in software development</p><p> Enhance problem-solving and critical thinking skills through real-world project challenges</p><p> Develop proficiency in communication and presentation skills through project presentations and documentation System Administration: Learning about system configurations, patch management, and deployment strategies</p><p> Software Engineering: Acquiring skills in software development methodologies, coding practices, and version control systems</p><p> Data Analytics: Exploring data analysis techniques to derive insights from system usage patterns and historical data (though not emphasized, basic understanding could be beneficial)</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1889,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Low-code Application Data Security",
      "description": "<p> Background</p><p> Oracle Real Application Security (RAS) introduces the next generation of application access control framework within the database enabling applications to declaratively define and enforce their security requirements. Oracle RAS introduces a powerful policy-based authorization model that recognizes application-level users, privileges, and roles within the database, and then controls access to both static and dynamic collections of records representing business objects. Refer to Oracle RAS white paper and Documentation for more information.</p><p> Problem</p><p> Security is essential for controlling application access to the valuable data of your organization. How to make it super easy and fast to develop applications to leverage the RAS security model?</p><p> Team project goal</p><p> Build tools and modules on Low-code platforms to help developers enforce end-to-end application data security.</p><p> Project 1 – Low-code DB application data security for APEX</p><p> Develop an Oracle Application Express (APEX) tool to help APEX developers secure their applications without writing PL/SQL code for RAS policy definition. The tool will provide a UI to help users specify data access control requirements easily, and auto-generate RAS policies for application tables and views. The user should be able to review policies, make changes as needed, and apply or un-apply them on database objects.</p><p> Project 2 – Low-code Java application data security for Sprint Boot</p><p> Develop a Sprint Boot module to manage RAS application sessions transparently for application access to the database. The module will be configurable and integrated with Sprint Boot Sessions to capture Application user identity, set up the RAS application session and enable it upon application connection pool access. </p><p> Project 3 – Demo application for college student record access using RAS</p><p> Develop an APEX application and a Java application to manage college student records. It will demonstrate end-to-end application data security for application table rows and columns based on access policies for admins, professors, and students. The application developers should define the application functionality and security requirements and implement the applications using the tool and integration modules from Project 1 and Project 2. o Database and security concepts</p><p> o SQL and PL/SQL </p><p> o Java programming &nbsp; o Database authorization, fine-grained access control</p><p> o Java application security </p><p> o Oracle Application Express</p><p> o Sprint Boot framework and security</p><p> o Oracle OCI and cloud databases Database and security concepts</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5516,
      "stationName": "Oracle, Bangalore",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1048,
      "projectId": 1890,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Concise summaries of Audit Insights using AI/ML",
      "description": "<p> With Oracle Data Safe Activity Auditing, users can comprehensively monitor and manage database activities. Refer to Documentation for more information.</p><p> Audit Insig Database and security concepts</p><p> SQL and PL/SQL</p><p> ML and Generative AI concepts</p><p> Java programming Self-motivated, innovative, hard-working Generative AI with LLM</p><p> REST API</p><p> Oracle OCI and Cloud databases</p><p> Oracle Data Safe Courses covering</p><p> Database and security concepts</p><p> SQL and PL/SQL</p><p> ML and Generative AI concepts</p><p> Java programming</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}