{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5248,
      "stationName": "UBS- RAS (Finance), Pune",
      "stationCity": "Pnq",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2157,
      "projectId": 3353,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Intern in Reporting and Analytics (RAS)",
      "description": "<p>Intern in Reporting and Analytics (RAS)</p><p><br></p><p>Your role</p><p>Are you a stickler for getting things right? Do you know how to solve problems? We are looking for</p><p>someone like this who can help us work on some interesting projects,</p><p>The role is within RAS India which provides management reporting and analytical services to global</p><p>internal partners. Main team focus is on Group Reporting, Group Treasury, Investment Bank Reporting,</p><p>Cost Reporting, Service Management and automation through a Joint Venture with the IT team.</p><p>The Project work will initially entail but will not be limited to Shadowing a senior lead as a mentee to</p><p>understand Day to Day Business requirements and work expectations within the assigned sub division.</p><p>This will enable the candidate to get a more practical view of the industry and the skills required to excel.</p><p>Working on specific work assignments which will broadly fall in the remit of creation and publication of</p><p>Reports along with Analytical inputs. Analyzing and assisting in automation of existing work stack with</p><p>usage of advanced data visualization tools. This task will have both consultative as well as execution</p><p>based aspects. Ideal candidate will have a flair of working with large data sets. Capability to mine</p><p>information and interpret the same. Excellent logical reasoning. The candidate should have an aspiration</p><p>of working in Analytics and Data Visualization and Reporting stream post completion of the Degree</p><p>Programme.</p><p><br></p><p>Your assignment</p><p>The candidate will be assigned to one of the reporting teams mentioned below.</p><p>• RAS Control Group which works as a strong data governance and monitoring team to ensure integrity</p><p>and sanctity of reporting and distribution on our reporting platform. The work provides an opportunity</p><p>to showcase communication skills with internal and external clients, maintaining data integrity and</p><p>security of information apart from working on new insightful MIS for top management.</p><p>• RAS Group Access Management team works as a string backbone to ensure security of data access to</p><p>some of the most critical source and MI systems in the bank.</p><p>• RAS-Agile Reporting and Transformation team is a team delivering rapid response information delivery</p><p>capability. This focuses on automation opportunities across existing reporting landscape using PowerBI,</p><p>MicroStrategy, Tableau, Oracle, PostgreSQL, Python development etc..</p><p>• RAS-IB Reporting team which looks after high value reporting for key stakeholders while dealing with</p><p>some key insightful, interesting and complex reporting requirements.</p><p><br></p><p>Your experience and skills</p><p>You have:</p><p>– strong analytical and numerical skills combined with a flair of visualization</p><p>– ability to focus on details and quality</p><p>– knowledge using MS Excel, VBA skills will be an added advantage</p><p>– understanding of accounting principles as a plus</p><p><br></p><p>You are:</p><p>– a problem solver able to scope/prioritize along guidelines and willing to take ownership</p><p>– a team player and strong communicator with interpersonal skills</p><p>– flexible and resilient with a positive attitude towards change</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "niranjanswain@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}