{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5127,
      "stationName": "Qure.ai - Product Management",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2415,
      "projectId": 3677,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Product Management (Bengaluru )",
      "description": "<p>Title: Product Management (Bengaluru )</p><p>Description:</p><p>Join us at Qure.ai Technologies, one of the world’s most widely deployed AI software in the healthcare</p><p>sector. As a Product Management Intern, immerse yourself in the dynamic interplay of cutting-edge</p><p>artificial intelligence and medical innovation. Work collaboratively with an interdisciplinary team of</p><p>product managers, medical professionals, and AI researchers. Contribute to projects that encompass</p><p>market research, mapping user experience, defining criteria for AI model development, and publishing</p><p>research papers.</p><p>Skill sets:</p><p>• Analytical thinking and data interpretation</p><p>• Familiarity with AI concepts (a plus, but not mandatory as fundamental principles will be</p><p>covered in orientation)</p><p>• Effective communication and presentation skills</p><p>• Proficiency in tools like JIRA, Figma and Chat GPT</p><p>• Ability to collaborate with cross-functional teams like Engineering, Design, AI R&amp;D, Clinical</p><p>Research, Regulatory, Marketing and Customer Support</p><p>• An ideal candidate would be a versatile generalist, adept at wearing multiple hats, navigating</p><p>between diverse functions, and bridging gaps in a dynamic, AI-driven healthcare landscape.</p><p>Expected learning:</p><p>1. AI in Healthcare: Understand the intricacies of integrating artificial intelligence in healthcare,</p><p>its challenges, and its transformative potential.</p><p>2. User-Centered Design: Dive deep into user research and understanding user journeys to</p><p>build products that resonate with the end user.</p><p>3. Strategic Roadmapping: Understand how to prioritize features, set product goals, and</p><p>develop a strategic roadmap in alignment with business objectives.</p><p>4. Go-to-Market Strategies: Gain insights into launching products in the market, understanding</p><p>positioning, pricing, and promotion strategies.</p><p>5. Feedback Loop Creation: Learn the art of collecting feedback, iterating on the product, and</p><p>continuously improving to meet market demands.</p><p>Specific courses required for project execution: None</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 45000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 45000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "swarna.chaudhary@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}