{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6340,
      "stationName": "Wayfair Global Technology Pvt. Ltd-Marketing, Data and ML platform Engineering team",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2192,
      "projectId": 3407,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Software Intern (Marketing, data and ML platform)",
      "description": "<p>Description: The Marketing Engineering team is responsible for building</p><p>Wayfair's class leading, data centric technology platform that optimizes and</p><p>powers all of Wayfair's paid advertising. It touches hundreds of millions of</p><p>consumers and drives billions of dollars in annual revenue. Our platforms allow</p><p>us to scale our marketing efforts efficiently by automating key processes,</p><p>interacting with ad vendors in real time and leveraging hundreds of terabytes of</p><p>data and ML algorithms for optimization and effective decision making on millions</p><p>of items in our catalog.The types of systems built by this team range from low</p><p>latency REST APIs, to real time streaming systems to high performance large</p><p>scale batch systems.</p><p>Skill sets:Computer Science, Programming in any popular language (Java/C#</p><p>preferred), Git, Linux/Unix based operating system, SQL, NoSQL, Message</p><p>Queues, Cloud native application</p><p>Expected learning: Interns will get hands-on experience in working on real world</p><p>projects which incorporate building systems at scale, hosting APIs in GCP (Google</p><p>cloud platform), CI/CD pipelines and introduction to various aspects of software</p><p>development like planning (Sprint planning), design, testing (Automated) and</p><p>maintenance.</p><p>Specific courses required for project execution: Computer Science</p><p>Fundamentals, Object Oriented Design, Operating Systems, Databases, cloud</p><p>fundamentals.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}