{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6257,
      "stationName": "Stemz Healthcare",
      "stationCity": null,
      "businessDomain": "Health Care",
      "problemBankId": 2010,
      "projectId": 3177,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project 1 Title: Intern for Carbon Footprint Analysis, Benchmarking, and Energy Efficiency  Enhancement",
      "description": "<p><br></p><p>Description:</p><p>The intern will lead a project to assess the carbon footprint of our 14 medical centers</p><p>located across 6 countries in Asia. This project involves collecting data,</p><p>benchmarking against similar organizations, and developing a framework for</p><p>continuous tracking, reporting, and reduction of carbon emissions. Simultaneously,</p><p>the intern will work towards identifying and implementing energy-efficient practices.</p><p>Additionally, they will help oversee the automation of data collection and reporting</p><p>processes, aiming to reduce human intervention and improve overall operational</p><p>efficiency.</p><p>Skill sets:</p><p>• Knowledge of carbon footprint analysis and energy efficiency metrics</p><p>• Familiarity with sustainability and environmental impact assessment tools</p><p>• Basic understanding of automation technologies</p><p>• Data analysis and reporting (proficiency in Excel, Power BI, or similar tools)</p><p>• Project management skills to oversee the framework development and implementation</p><p>• Good understanding of technical documentation and reporting</p><p>• Familiarity with sustainability standards such as ISO 14001 is a plus</p><p>Traits expectation:</p><p>• Self-motivated and proactive in identifying areas for improvement</p><p>• Strong analytical and problem-solving skills</p><p>• Ability to work independently and in cross-functional teams</p><p>• Attention to detail and precision in data handling</p><p>• Enthusiasm for sustainability and environmental initiatives</p><p>• Good communication skills to collaborate with different stakeholders</p><p>Expected learning:</p><p>• Practical experience in conducting and interpreting carbon footprint assessments</p><p>• Exposure to energy-efficient practices and green building certifications</p><p>• Project management and automation techniques in a real-world setting</p><p>• Understanding of sustainability frameworks and global standards</p><p>• Experience in working with multidisciplinary teams and implementing actionable insights</p><p>Disciplines/courses in the following areas preferred:</p><p>• Sustainability and Environmental Management</p><p>• Energy Efficiency and Renewable Energy Systems</p><p>• Data Analytics for Environmental Decision-Making</p><p>• Automation in Industry (Robotics and AI Integration)</p><p>• Project Management for Engineers</p><p>• Carbon Footprint Calculation and Reporting Tools (such as GHG Protocol)</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bharathir@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}