{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5567,
      "stationName": "Bugbase Security Private Limited",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 909,
      "projectId": 1690,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Integrated Platform Enhancement Project: Software Development",
      "description": "<p>Description: BugBase is a continuous vulnerability assessment platform. It is a managed marketplace</p><p>of bounty hunters that facilitates startups and enterprises in hosting and managing bug bounty programs</p><p>and helps organizations continuously identify, manage, and mitigate real security vulnerabilities by</p><p>plugging into Bug Bounty and pen-testing programs.</p><p>We are looking for Full-Stack Developer interns, preferably dual-degree students with a Master's in</p><p>Sciences and a Bachelor's in Engineering, having a possibility of continuing this internship for the</p><p>further semester as a part of the dual-PS2 procedure.</p><p>Responsibilities:</p><p>Your role would be to build new features and improve the website.</p><p>Introducing best coding practices, which include frontend and backend technologies in web</p><p>applications.</p><p>Improving code quality and implementing new features in the application</p><p>Collaborate with the technical team to upkeep and enhance BugBase's website.</p><p>Skillsets: Nextjs, Reactjs, Javascript + Typescript, CSS, Node.js, Express, MongoDB, Mongoose +</p><p>Knowledge of Web Fundamentals, Browser Workings, REST API, Docker, Creativity and Innovation,</p><p>Collaboration and Teamwork, Adaptability and Flexibility, Attention to Detail, Time Management and</p><p>Organization.</p><p>Additional Plus points: Orchestration using Docker, Docker Compose, Self Deployments of full-stack</p><p>applications</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 10000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 10000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}