{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6354,
      "stationName": "LENS Corporation",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2212,
      "projectId": 3429,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Advanced Computer Vision for Real-Time Object Detection and Segmentation",
      "description": "<p><br></p><p>Description: In this project, you will work as a Computer Vision Research Engineer at LENSCORP. focusing on the development of real-time computer vision solutions for applications in various industries. The project involves the end-to-end process of designing, training, and deploying computer vision models to tackle complex problems such as detecting, segmenting, and classifying objects in challenging environments. You will be tasked with optimizing models for real-time performance on edge devices and improving accuracy through innovative techniques, including model fusion, patch-based inference, and uncertainty estimation.</p><p><br></p><p><br></p><p>Skill sets:</p><p>(CNNs)</p><p>Proficiency in Deep learning frameworks like Py Torch. Familiarity with deep learning techniques, especially convolutional neural networks transformer-based and architectures.</p><p>augmentation</p><p>Experience with image processing techniques, segmentation models, and data methods.Lab, Knowledge of computer vision algorithms and tools (e.g., YOLO, Faster R-CNN, Deep Mask R-CNN).</p><p>Expected learning:.</p><p>Hands-on experience with real-world computer vision applications and techniques. deployment tuning. and performance Opportunity to learn about advanced topics like model compression, quantization, and optimization. latency</p><p>Exposure to the complete ML pipeline, from research and development to deployment</p><p>Gain expertise in using hardware acceleration tools and frameworks for optimized inference on edge devices and servers.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 75000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 75000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}