{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6322,
      "stationName": "UBS- Global Banking(Front office)",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2154,
      "projectId": 3350,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "UBS- Global Banking(Front office)",
      "description": "<p>UBS- Global Banking(Front office)</p><p>Job Description:</p><p>• Performing analysis for target corporate clients – this will include understanding industry</p><p>dynamics, financial model of the specific companies and staying updated on recent</p><p>developments</p><p>• Idea generation – Being aware of trends and developments in the industry and combining this</p><p>with product knowledge to spot opportunities for UBS to assist clients.</p><p>• You will assist on data analysis and summary inference articulation for UBS internal approval</p><p>processes (writing reports and analyses and presenting internally)</p><p>• Help in deal execution by coordinating with relevant teams internally</p><p>As part of the Global Banking team, you will:</p><p>• Work on various pitches, mandates for various advisory and capital markets transactions across various</p><p>sectors.</p><p>• Assist in preparation of pitch books - produce well-argued presentations and detailed analysis.</p><p>• Help in various workstreams across the deal life cycle/ execution by coordinating efforts along</p><p>with relevant teams internally</p><p>You must have:</p><p>• You have basic excel modeling and financial statements understanding</p><p>• You are able to present in a measured, clear, articulate way</p><p>• You have excellent organizational skills and are able to multi-task across many tasks and</p><p>projects and plan ahead</p><p>• You have strong written and verbal communication &amp; presentation skills</p><p>• Ambitious, dedicated who can work on own initiative whilst also working collaboratively and</p><p>deliver on time with a high level of integrity, sense of urgency, attention to detail and quality</p><p>standards.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "niranjanswain@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}