{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6028,
      "stationName": "Gateway.fm ( Online )",
      "stationCity": "Mum",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1638,
      "projectId": 2718,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Stakeway",
      "description": "<p><br></p><p>Title: Stakeway</p><p>Description: Work involves running and maintaining node that secure blockchain network.</p><p>Skill sets: Good to have 1 or more from the list, Golang or python or smart contract or DevOps (AWS Clouds)</p><p>Traits expectation:&nbsp;</p><p>Expected learning: Work on Blockchain technology, write code which can help us in validating</p><p>Specific courses required for project execution: Computer programing, data structure algorithms, Linux</p><p>Title: CDK-Erigon: Go Engineer and QA Automation</p><p>Description: The project focuses on contributing to the cdk-erigon repository, which is a blockchain infrastructure project. Interns will primarily work on implementing unit tests, refactoring existing code, and making improvements to enhance the performance and maintainability of the codebase. The project is geared towards students interested in blockchain and low-level programming.</p><p>Skill sets: Proficiency in Go – 1) Understanding of blockchain technology (preferably experience with EVM) 2) Python 3) Experience with QA automation tools is a plus</p><p>Traits expectation: 1) Proactivity 2) Teamwork 3) Strong problem-solving skills</p><p>Expect learning: 1) Hands-on experience in EVM and zkEVM core development 2) Improved proficiency in Go programming 3) Practical knowledge of blockchain infrastructure and QA automation&nbsp;</p><p>Specific courses required for project execution: 1) Understanding of EVM or related blockchain systems 2) Familiarity with Go programming and Python 3) Exposure to software engineering principles and QA best practices</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 500,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 500,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}