{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6488,
      "stationName": "Premji Investment- Frontend development",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2435,
      "projectId": 3699,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Frontend Intern @ Premji Invest, Bangalore",
      "description": "<p><strong style=\"background-color: rgb(255, 255, 255); color: rgb(0, 0, 0);\">About the firm</strong></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">At Premji Invest, our goal is to generate best-in-class returns by supporting innovative entrepreneurs and high-performing companies. We invest in early-stage, growth equity and public markets across India and the United States. Our focus areas are financial services, technology, healthcare, consumer, industrials, and buyouts, with an underlying charter to back emerging and disruptive technologies and nurture the spirit of entrepreneurship in the country.&nbsp; Our abiding purpose is to support the philanthropic initiatives of the Azim Premji Foundation, a not-for-profit organisation that seeks to help improve the lives of the underserved and underprivileged in society.</span></p><p><br></p><p><strong style=\"background-color: rgb(255, 255, 255); color: rgb(0, 0, 0);\">About the role</strong></p><p><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">The role pertains to the Data Science team whose mandate is to provide transform the research methodology from fundamental to Quantamental which uses Quantitative insights and rigorous data analysis to make investment decisions. We are looking for a front-end developer for the ongoing projects related to building cloud-based database and analytics infrastructure for the public markets team. Some of the key responsibilities of the front-end developer will include:</span></p><p><br></p><ul><li><strong style=\"background-color: transparent; color: rgb(0, 0, 0);\">Creating front-end UI for the applications being developed by the Data Science team for different stakeholder groups across the organization that will facilitate assessing and enhancing the performance of portfolios across the fund and aid financial research</strong></li><li><strong style=\"background-color: transparent; color: rgb(0, 0, 0);\">Collaborate with the stakeholders to take the business requirements accurately and bake in the UI to ensure better adoption and ease of usage by them</strong></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Collaborate internally with backend development to optimize the overall performance of the applications rolled out to the different teams of Database specialist, developing pipelines for ingestion of multiple datasets from various vendors into the cloud database&nbsp;</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Assisting in creation of robust ETL jobs for the ongoing automated ingestion of the datasets along side the Database specialist</span></li><li><strong style=\"background-color: transparent; color: rgb(0, 0, 0);\">Working alongside Quantitative researchers to develop interactive and real-time retrieval dashboards for PMs and traders that will directly impact the investment decision-making</strong></li><li><strong style=\"background-color: transparent; color: rgb(0, 0, 0);\">Creating data visualization toolkit for enhancing the ease of extracting insights and locating value amidst the abundance of data</strong></li></ul><p><strong style=\"background-color: rgb(255, 255, 255); color: rgb(0, 0, 0);\">Required Qualifications</strong></p><p><br></p><ul><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Pre-final year of Bachelor’s/Dual Degree in Computer Science, EE, Maths and Data Science</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Good programming experience with at least one modern language such as Java, C++, or C# including object-oriented design</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Experience with UI/UX development – technologies like React and Angular</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Experience with web-development, proficiency in angular, HTML/JavaScript/CSS</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Experience with SQL and dealing with databases</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Sought out knowledge source in: Computer Science fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis</span></li><li><span style=\"background-color: transparent; color: rgb(0, 0, 0);\">Advanced proficiency in Python from a development perspective</span></li></ul><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}