{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5534,
      "stationName": "Impact Analytics",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 872,
      "projectId": 1617,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "QA Python Scripting Intern",
      "description": "<p>The impact that you will be making</p><p>? Strong knowledge in Python scripting.</p><p>? 0-6 months of Python experience</p><p>? Automate manual test cases developed by QA Engineer.</p><p><br></p><p>What lands you in this role</p><p>? Basic knowledge and understanding of testing.</p><p>? Attention to detail and should be very good at Python scripting.</p><p>? Should have good coding skills.</p><p>? Should have done a certification course on Python.</p><p>? BE/BTech in computer science or equivalent technical education</p><p>What we offer</p><p>? An opportunity to develop some of the best enterprise SaaS products to be built out</p><p>? of India</p><p>? Opportunities to quench your thirst for problem-solving, experimenting, learning, and</p><p>? implementing innovative solutions</p><p>? A flat, collegial work environment, with a work hard, play hard attitude</p><p>? A platform for rapid growth if you are willing to try new things without fear of failure.</p><p>? Remuneration with best-in-class industry standards with generous health insurance</p><p>cover</p><p>About Impact Analytics</p><p>Impact Analytics (Series C funded) is a proven, enterprise-grade analytics leader in AI-based</p><p>retail, grocery, CPG, and supply chain SaaS solutions. Its suite of planning, forecasting,</p><p>merchandising, category management, and end-to-end lifecycle pricing products empowers</p><p>organizations to make data-driven decisions that transform their business for greater</p><p>profitability. The company was recently ranked in the top 100 of Fortune's 2023 list of the</p><p>Most Innovative Companies in America and also made The Financial Times' list of America's</p><p>Fastest Growing Companies for the fourth straight year. Learn more at</p><p>www.impactanalytics.co.</p><p>Some of our accolades include:</p><p>? Ranked #72 in America’s Most innovative Companies list in 2023 alongside</p><p>companies like Microsoft, Tesla, Apple, IBM, etc</p><p>? Ranked as one of Americas' fastest growing companies by Financial Times for</p><p>four consecutive years: 2020-2023</p><p>? Ranked as one of Americas' fastest-growing private companies by Inc 5000 for</p><p>Six consecutive years: 2018-2023</p><p>? Recognized in multiple Gartner reports, including Market Guides and Hype Cycle,</p><p>spanning assortment, merchandising, forecasting, algorithmic retailing, and</p><p>Unified Price, Promotion, and Markdown Optimization Applications.</p><p>? Featured as one of top 25 ML startups to watch by Forbes in 2019</p><p>? Ranked as one of North Americas' fastest-growing technology companies by</p><p>Deloitte for two consecutive years 2019 &amp; 2020</p><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 15000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 15000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}