{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5486,
      "stationName": "SECRETSTENCIL TECHNOLOGIES PRIVATE  LIMITED",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 866,
      "projectId": 1609,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Product Management for HRMS Portal",
      "description": "<p class=\"ql-align-justify\"><strong>Description: </strong>A Product Manager for an HRMS (Human Resource Management System) Portal is responsible for overseeing the development and management of a comprehensive HR technology solution. This role involves coordinating cross-functional teams to design, build, and launch features that enhance user experience and streamline HR operations. The Product Manager ensures the portal meets market needs and complies with regulatory standards, while aligning with the business’s strategic goals.</p><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p class=\"ql-align-justify\"><strong>Skill sets: </strong>Technical Proficiency: Knowledge of software development processes, database management, and basic coding principles. Project Management: Strong organizational and project management skills to handle multiple priorities in a dynamic environment. User Experience Design: Understanding of UX design principles to enhance user interaction with the HRMS portal. Data Analysis: Ability to analyze user data and feedback to inform product decisions and improvements. Communication Skills: Excellent verbal and written communication skills to interact with stakeholders and team members effectively. Problem-solving: Strong analytical and problem-solving skills to address challenges and innovate solutions.</p><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p class=\"ql-align-justify\"><strong>Traits expectation: Leadership: </strong>Ability to lead and motivate a team, driving projects to completion. Adaptability: Flexible in handling changes in technology and business environments. Strategic Thinking: Capable of thinking strategically to align product features with business goals. Attention to Detail: Meticulous attention to detail to ensure quality and compliance in product outputs. Customer-oriented: Focused on creating value for users and improving their experience with the HRMS portal.</p><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p class=\"ql-align-justify\"><strong>Expected learning: Advanced Product Management Techniques: </strong>Learning cutting-edge product management frameworks and methodologies. HRMS Specific Knowledge: Gaining deeper insights into human resources processes and legal considerations specific to HR tech. Technical Skills Enhancement: Updating technical skills relevant to software development and UX/UI design. Leadership and Communication: Enhancing leadership abilities and communication skills for better team and stakeholder management.</p><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p><strong>Specific courses required for project execution: </strong>Human Resource Development, Professional Ethics</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 15000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 15000,
      "createdBy": "f20212109@pilani.bits-pilani.ac.in",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5486,
      "stationName": "SECRETSTENCIL TECHNOLOGIES PRIVATE  LIMITED",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 866,
      "projectId": 1610,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Product Marketing for B2B SaaS Services",
      "description": "<p class=\"ql-align-justify\"><strong>Description: </strong>The Product Marketing Manager for B2B SaaS Services is responsible for driving the go-to-market strategy and execution for software-as-a-service products targeted at business customers. This role involves understanding customer needs, market trends, and the competitive landscape to position the SaaS product effectively. The manager will create messaging and marketing materials, collaborate with sales teams to enable them, and manage product launches to maximize product uptake and success.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\"><strong>Skill sets:</strong> Market Research: Strong ability to conduct and analyze market research to understand industry trends and customer needs. Content Creation: Proficiency in creating compelling content such as blog posts, whitepapers, case studies, and sales enablement materials. Digital Marketing: Experience with digital marketing strategies including SEO, SEM, and social media marketing to enhance product visibility. Product Lifecycle Management: Understanding of the product lifecycle from inception through launch and beyond. Data-Driven Decision Making: Capability to use analytics to drive decisions and measure the effectiveness of marketing strategies. Communication Skills: Excellent interpersonal and communication skills to work effectively with cross-functional teams and communicate with stakeholders.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\"><strong>Traits expectation: </strong>Creativity: Ability to generate innovative ideas for marketing strategies and problem solving. Analytical Mindset: Strong analytical skills to interpret complex market data and improve marketing efforts. Proactive Leadership: Capacity to lead initiatives and motivate teams without direct authority. Adaptability: Flexibility to adapt to rapidly changing trends and technology in the SaaS industry. Customer Focus: Commitment to understanding and fulfilling the needs and challenges of business customers.</p><p class=\"ql-align-justify\"><strong>&nbsp;</strong></p><p class=\"ql-align-justify\"><strong>Expected learning: </strong>Advanced Marketing Strategies: Deepening knowledge of cutting-edge marketing techniques and digital marketing trends. Customer Insights: Enhancing skills in customer psychology and buying behaviors in the B2B SaaS market. Technical Proficiency: Staying updated on the latest developments in SaaS products and industry standards. Strategic Planning: Gaining skills in strategic planning and execution to align marketing initiatives with business goals.</p><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 15000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 15000,
      "createdBy": "f20212109@pilani.bits-pilani.ac.in",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}