{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5245,
      "stationName": "Nykaa,Gurugram",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2177,
      "projectId": 3376,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "JD Data Scientist",
      "description": "<p>The Role - Data Science Analyst/Intern</p><p>Data in the current business environment is the key for business success. As a Data Science Analyst you will be a part of the team working closely with cross-functional teams to extract, analyze, and visualize data to uncover insights that drive informed business decisions. You will also be responsible for developing and maintaining data models and predictive analytics to support our company's goals</p><p>Responsibilities</p><p>? Collaborate with business stakeholders to understand data requirements and objectives. ? Collaborate with the data science team to collect, clean, and analyze large datasets</p><p>? Extract, transform, and load (ETL) data from various sources, including databases, APIs, and external datasets.</p><p>? Perform exploratory data analysis to identify trends, patterns, and anomalies in the data.</p><p>? Develop and maintain predictive models, machine learning algorithms, and statistical analyses to solve business problems.</p><p>? Create data visualizations and dashboards to communicate insights effectively to non-technical stakeholders.</p><p>? Monitor model performance and make necessary adjustments to ensure accuracy and reliability.</p><p>? Work with the data engineering team to ensure data quality and integrity.</p><p>? Stay up-to-date with the latest advancements in data science and analytics.</p><p>? Support the development of data-driven strategies and provide recommendations for process improvements</p><p>Qualifications &amp; Competencies Master's degree in a quantitative field such as Mathematics, Statistics, Economics, Analytics, computer science or related fields. Internships in field of Data &amp; Analytics will be preferred Key Competencies</p><p>? Proficiency in data manipulation, analysis, and visualization using tools such as Python, R, or similar.</p><p>? Experience with machine learning libraries (e.g., scikit-learn, TensorFlow, or PyTorch).</p><p>? Strong analytical and problem-solving skills.</p><p>? Solid understanding of statistical concepts and techniques.</p><p>? Knowledge of SQL and database management systems.</p><p>? Some Experience with data visualization tools (e.g., Tableau, Power BI, or similar)</p><p>? Excellent problem solving and comprehensive analytical skills - ability to structure ambiguous problem statements, perform detailed analysis and derive crisp insights.</p><p>? Strong communication and presentation skills - ability to connect the dots through data, communicate and present with impact to all levels of the organization</p><p>? Intellectual Curiosity - Initiative to dig into the who, why, where, what &amp; how. Curiosity about business and customer behavior</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "swarna.chaudhary@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}