{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6323,
      "stationName": "UBS- Risk Data, Pune",
      "stationCity": "Pnq",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2155,
      "projectId": 3351,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Job Title: Data Technical Analyst (Risk Data Management) – Internship",
      "description": "<p>Job Title: Data Technical Analyst (Risk Data Management) – Internship</p><p><br></p><p>UBS is a systemically important investment bank and financial services company with presence in all major</p><p>financial centres as the largest Swiss banking institution and private bank in the world.</p><p>We are seeking innovative and energetic individuals to work on our control capabilities in Risk data for</p><p>improving quality, which is one of the primary objectives of data management. Our team is set up to</p><p>remediate data-quality issues more rapidly, in addition to the standard processes.</p><p><br></p><p>This is a unique program geared toward providing exposure to a complex data architecture of a world-</p><p>wide Financial Institution. As we apply sophistication in our controls to use standard reconciliations,</p><p><br></p><p>statistical analysis, as well as artificial intelligence and machine learning–based techniques, we need</p><p>talented individuals who can understand aspects of data analysis and its application to derive value.</p><p>Your journey will begin with an initial assignment to a team that has specific roles and responsibilities. As</p><p>you progress through the program, you may get chance to work with different complimentary teams,</p><p>where the roles and responsibilities will change. This is an exciting opportunity as a first step in your</p><p>career in the fast-evolving field of data management and data driven business.</p><p>We’ll provide you with the resources and opportunity to get acquainted with highly experienced</p><p>individuals working at the interface between IT and Business such as Technology Analysts, Data</p><p>Governance Specialists, Risk Data Experts and Data Scientists.</p><p>Your role:</p><p>• gather information from various sources and interpret patterns to identify issues in F2B flow</p><p>• efficiently coordinate with various stakeholders to understand the complex data flow end-to-end</p><p>to identify drivers for errors, perform root cause analysis</p><p>• interpret data and turn it into information for offering ways to remediate a DQ issue</p><p>• Report findings to Data Governance Specialists to inform business decisions</p><p>• Understand physical lineage within GRC for Key Data Outputs</p><p>Your team:</p><p>You’ll be working in the Risk Data Management team within the Group Risk Control (GRC) function in</p><p>Mumbai / Pune. The team is global with members in Switzerland, UK, US, and India (Mumbai, Pune and</p><p>Hyderabad) and its primary responsibility is to identify and control the impact of risk on the firm’s usage</p><p>of data to manage its exposures to credit, market, funding, liquidity, and other risks.</p><p>We are a group of highly skilled professionals working in a sophisticated and fast-paced environment. We</p><p>are passionate about what we deliver and the benefit it brings, we come from all backgrounds, and a fun</p><p>group of individuals. We work in a flexible, agile, and globally distributed environment.</p><p>You have:</p><p>• some understanding of: (i) data extraction from database, (ii) Excel / SQL / Python</p><p>• basic knowledge of financial products offered in an IB and Wealth Management setup</p><p>• keen interest in understanding business context for the data</p><p>• some understanding of measures used in models for Credit Risk measurement</p><p>• ability to quickly understand complex processes and challenge the status quo</p><p>• an analytical mind and inclination for problem-solving, an attention to detail</p><p>• intellectual curiosity and are able to train yourself on various techniques and tools</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "niranjanswain@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}