{
  "projectId": 2467,
  "stationId": 5918,
  "problemBankId": 1428,
  "problemBankCreatedBy": "planning@bits.com",
  "stationCreatedBy": "planning@bits.com",
  "stationCreatedStudentName": null,
  "isStationCreatedByStudent": false,
  "title": "Generative AI Enterprise API – Development and Testing Project",
  "description": "<p>We are seeking experienced consultants with various experience levels specializing in Generative</p><p>AI to join our dynamic team. The ideal candidate will play a pivotal role in the development,</p><p>test/evaluation and implementation of Generative AI software, Language Models (LLMs), Models,</p><p>APIs, Solutions and Use Cases. Additionally, the consultants will be responsible for conducting</p><p>training sessions and actively contributing to solutioning by creating innovative and effective</p><p>solutions.</p><p>Expected learning: End to end software development lifecycle.</p><p>• Design and Develop APIs: Create and implement robust, scalable APIs that integrate with</p><p>various components of the LLM Ops chain, ensuring seamless data flow and functionality</p><p>across different systems.</p><p>• Build Business Applications: Develop comprehensive business applications tailored to</p><p>support LLM Ops processes, focusing on high performance, security, and user</p><p>experience.</p><p>• Test and Prototype: Conduct thorough testing of APIs and applications, identifying and</p><p>resolving any issues or bugs. Create and refine prototypes to demonstrate functionality</p><p>and gather feedback for further improvements.</p><p>• Conduct Comprehensive Testing and Evaluation: Perform thorough testing and evaluation</p><p>of Generative AI software, Language Models (LLMs), Models, APIs, Solutions, and Use</p><p>Cases to ensure performance and reliability.</p><p>• Develop and Implement Testing Strategies: Create and execute detailed testing strategies</p><p>to validate AI/ML applications, ensuring they meet quality standards and functional</p><p>requirements.</p><p>• Leverage Programming Proficiency: Utilize expertise in programming languages such as</p><p>Python, Java, and C++ to design and implement robust testing strategies tailored for</p><p>AI/ML applications.</p><p>• Utilize Cloud Platforms for Testing: Conduct testing in cloud environments like AWS,</p><p>GCP, and Azure to ensure compatibility and scalability of AI/ML solutions.</p><p>• Integrate Testing with Developer Tools: Seamlessly incorporate testing processes into</p><p>popular developer tools (Git, Jenkins, Docker, Kubernetes) to streamline continuous</p><p>integration and deployment.</p><p>• Implement AI/ML Ops Best Practices: Apply AI/ML Ops best practices to address</p><p>challenges and stay updated on emerging techniques, optimizing testing procedures for</p><p>efficiency.</p><p>• Specialized Testing for LLMs and Generative AI Models: Utilize knowledge of Large</p><p>Language Models (LLM) and Generative AI Models for specialized testing and validation</p><p>in these areas.</p><p>• Awareness of Vector Databases: Enhance testing capabilities by understanding and</p><p>validating data storage and retrieval in vector-based applications.</p><p>• Collaborate with Development Teams: Work closely with development teams to ensure</p><p>testing processes are aligned with the AI/ML development lifecycle and project goals.</p><p>• Design and Implement Scalable Testing Environments: Create scalable testing</p><p>environments considering the unique resource requirements of AI/ML applications to</p><p>ensure comprehensive validation.</p><p>• Design and Deliver Training Sessions: Develop and conduct training sessions on</p><p>Generative AI products, tools, and utilities for internal teams and clients to enhance their</p><p>understanding and capabilities.</p><p>• Collaborate with Cross-Functional Teams: Work with cross-functional teams to gather and</p><p>understand client requirements, ensuring solutions meet their needs.</p><p>• Develop and Propose Innovative Solutions: Create innovative solutions leveraging</p><p>Generative AI technology, documented through solutioning documents and responses to</p><p>RFPs.</p><p>• Support End-to-End Solution Lifecycle: Provide comprehensive support throughout the</p><p>solution lifecycle as part of service delivery, ensuring successful implementation and</p><p>operation.</p><p>• Deliver Business Process Services: Offer business process services and solutions to</p><p>clients, enhancing their operational efficiency and effectiveness.</p><p>• Coordinate and Oversee Projects: Manage and coordinate AI/ML projects from inception</p><p>to completion, ensuring all project milestones and deliverables are met on time and within</p><p>budget.</p><p><br></p><p>• Collaborate with External Partners: Work closely with external partners and vendors to</p><p>ensure alignment with project goals and integration of third-party solutions into our AI/ML</p><p>infrastructure.</p><p><br></p><p><br></p><p>• Expertise in Generative AI: Strong expertise in developing and testing Generative AI</p><p>software, LLMs, Models, and APIs.</p><p>• Training Delivery: Demonstrated ability to deliver effective training sessions to internal</p><p>teams and clients.</p><p>• Problem-Solving and Innovation: Creative problem-solving skills for solutioning and</p><p>innovation in AI/ML projects.</p><p>• Communication and Collaboration: Excellent communication and collaboration skills to</p><p>work effectively with cross-functional teams.</p><p>Technical Skills:</p><p>• Programming Languages: Proficiency in one or more programming languages commonly</p><p>used in AI/ML and software development, such as Python, Java, C++, Rust, or Go.</p><p>• Cloud Platforms: Experience working with cloud services like AWS, GCP, or Azure, with</p><p>specific knowledge of machine learning services, edge computing, CLI/SSH, and compute</p><p>resources.</p><p>• Developer Tools: Experience with popular developer tools and platforms such as Git,</p><p>Google Colab, Notebooks, Jenkins, Docker, Kubernetes, and others.</p><p>• AI/ML Ops: Knowledge of AI/ML best practices, challenges, and emerging techniques.</p><p>Familiarity with LLM and Generative AI Models and Vector Databases is a plus.</p><p>• Test Strategy and Planning: Develop comprehensive test strategies, plans, and test cases</p><p>aligned with project objectives and quality goals.</p><p>• Architectural Understanding: Possess a deep understanding of system architectures to</p><p>design effective testing frameworks and strategies.</p><p>• Automation Architecture: Design scalable and maintainable test automation architectures</p><p>that support continuous testing.</p><p>• Tool Evaluation and Selection: Evaluate testing tools and technologies to select the most</p><p>suitable ones for the project.</p><p>• Risk-Based Testing: Implement risk-based testing strategies to prioritize testing efforts</p><p>based on potential impact.</p><p>• Domain Knowledge: Acquire in-depth domain knowledge to provide context-specific</p><p>testing insights.</p><p>• Consulting and Advisory: Offer strategic testing advice and recommendations to clients,</p><p>contributing to their testing maturity.</p><p>• Tool and Technology Agnostic: Be versatile and adaptable to work with various testing</p><p>tools and technologies based on client needs.</p>",
  "pstypeId": 2,
  "batchId": 16,
  "semesterId": 1,
  "salutation": "Mr.",
  "mentorName": "Shiv Asthana",
  "mentorEmailId": "shiv@trustwise.ai",
  "mentorContactNumber": "9676915050",
  "discViewModels": [
    {
      "projectId": 2467,
      "projectDisciplineId": 4921,
      "projectDisciplineCodes": "Any",
      "discCodesPerProject": "Any",
      "graduationTypeIds": [],
      "anySingle": false,
      "anyDual": false,
      "anyEither": true,
      "anyHigher": false,
      "anyDegree": false
    }
  ],
  "projectDiscipline": [
    {
      "projectDisciplineId": 4921,
      "projectId": 2467,
      "degreeTypeId": 3,
      "firstDegree": 1,
      "higherDegree": 0,
      "cgpamin": 0,
      "cgpamax": 10,
      "freshRequirement": 1,
      "totalRequirement": 1,
      "maleRequirement": 0,
      "femaleRequirement": 0,
      "continuingStudent": 0,
      "disciplineCodes": "Any",
      "graduationTypeIds": [],
      "degree": "Both",
      "continuingStudentCount": 0,
      "continuingStudentIds": null,
      "conditionalOffer": 0,
      "conditionalOfferCount": 0,
      "otherConstraint": 0,
      "otherConstraintCount": 0,
      "otherSuggestedStation": 0,
      "anyDualDegree": 1,
      "disciplineDetails": [],
      "selectedContinuingStudentList": null,
      "conditionalOfferStudents": null
    }
  ],
  "projectElective": [],
  "projectFacility": [
    {
      "projectFacilityId": 2381,
      "projectId": 2467,
      "officeStartTime": "09:00:00",
      "officeEndTime": "17:00:00",
      "weekHolidays": "Saturday,Sunday",
      "ugstipend": 60000,
      "pgstipend": 0,
      "scholarship": 0,
      "currency": "INR",
      "subsidizedLunch": 2,
      "boysAccommodation": 0,
      "girlsAccommodation": 0,
      "accomodationAddress": "",
      "ta": 2,
      "da": 2,
      "conveyance": 2,
      "medical": 2,
      "travels": 2,
      "others": "Work Hours Flexible to support India/US/UK time zones, but minimum 45 productive hours in a week.",
      "boysAccomodationAddress1": "",
      "boysAccomodationAddress2": "",
      "boysAccomodationCity": null,
      "boysAccomodationState": null,
      "boysAccomodationCountry": null,
      "boysAccomodationPincode": "",
      "girlsAccomodationAddress1": "",
      "girlsAccomodationAddress2": "",
      "girlsAccomodationCity": null,
      "girlsAccomodationState": null,
      "girlsAccomodationCountry": null,
      "girlsAccomodationPincode": "",
      "createdBy": "planning@bits.com",
      "createdDate": "2024-06-12T06:44:16",
      "modifiedBy": null,
      "modifiedDate": null,
      "girlsAccomodationOtherCityName": null,
      "boysAccomodationOtherCityName": null,
      "girlsAccomodationCityName": null,
      "boysAccomodationCityName": null
    }
  ],
  "projectSkill": [
    {
      "projectSkillId": 51331,
      "projectId": 2467,
      "skillId": 431
    },
    {
      "projectSkillId": 51332,
      "projectId": 2467,
      "skillId": 436
    }
  ],
  "projectAcademicDomain": [
    {
      "projectId": 2467,
      "projectDomainId": 3494,
      "academicDomainId": 65
    },
    {
      "projectId": 2467,
      "projectDomainId": 3495,
      "academicDomainId": 86
    },
    {
      "projectId": 2467,
      "projectDomainId": 3496,
      "academicDomainId": 5
    }
  ],
  "projectSubjectAreaSpecifics": [],
  "projectAcademicSubDomain": [
    {
      "projectSubDomainId": 3219,
      "projectId": 2467,
      "academicSubDomainId": 77
    }
  ],
  "projectSubjectArea": [],
  "continuingStudents": null
}