{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6399,
      "stationName": "Pharmeasy",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2293,
      "projectId": 3530,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Analytics Intern",
      "description": "<p>Designation : Data Analyst</p><p>Location : Bangalore</p><p>Our Team</p><p>PharmEasy was founded in 2015 with the sole purpose to make healthcare easily available,</p><p>accessible and affordable to all through the extensive use of new-age cutting-edge technology. Today,</p><p>we are one of India's largest healthcare aggregators connecting lakhs of patients to licensed</p><p>pharmacies &amp; diagnostic centres online for all their medical needs. We are particularly catering to</p><p>the chronic-care segment, and offer a range of services including medicine delivery,</p><p>tele-consultation, sample collection for diagnostic tests as well as subscription-based services for all</p><p>these categories.</p><p>Our highly efficient and technology led Consumer and Supply-chain platforms ensure that medicines</p><p>are delivered from a licensed pharmacy within six hours of the validation of prescriptions submitted</p><p>by our customers. And such customer promises are improving with the increasing scale of our</p><p>business, and continuous product innovation.</p><p>By extensively leveraging the latest in hardware and software technology, we are also committed to</p><p>eradicate fake medicines from the Pharma ecosystem that contribute to roughly 30% of drug</p><p>volumes in India. Our product innovations have allowed for complete data transparency in the entire</p><p>Pharma supply-chain to empower even the end-users to validate the authenticity and genuineness of</p><p>the medicines for every medicine sold, using constructs such as unique barcoding of information like</p><p>expiry dates, origination of drugs etc.</p><p><br></p><p>With our scalable technology and processes, we are now reliably delivering healthcare services and</p><p>medicines to every single pin code in the country.</p><p>Analytics @ Pharmeasy:</p><p>The analytics team at PharmEasy is a centralized team helping the organization in problem solving</p><p>and making data-driven decisions with the core objectives of making healthcare more accessible,</p><p>available and affordable using a wide variety of datasets, tools and techniques.</p><p>Being a data first organization, the team contributes vigorously across all facets of analytics from data</p><p>enrichment and modelling, from descriptive dashboarding to investigative root cause analysis and</p><p>insight generation, from building predictive/prescriptive algorithms to product integration to create</p><p>real business impact.</p><p>Team members also gather a good amount of exposure working closely with key business owners,</p><p>decision makers and product leaders that leads to building a well rounded experience in problem</p><p>solving in a new age set up. Over the years, team members also get to work across a variety of</p><p>business units within healthcare ecosystem.</p><p>Responsibilities :</p><p>Data Analyst would be responsible for working closely with the Business Teams and helping them in</p><p>making data driven decisions. This would require cross-communication between the Business Team,</p><p>Product Team &amp; Data Engineering as well. Apart from solving the business problem at hand, a Data</p><p>Analyst would also be responsible for creating reports and dashboards, automating repeated tasks,</p><p>sharing insights and learning basis the data exploration/mining</p><p><br></p><p>? Getting business requirements from the respective Business Teams, identifying the</p><p>underlying business case and building a generalized solution</p><p>? Extracting &amp; Exploring the data from database and other sources that may exist,</p><p>cleaning the data for any issues/missing values also needs to be owned upon</p><p>? Converting the cleaned data into actionable insights and sharing the same with relevant</p><p>Audience</p><p>? Automation of data problems/solutions that occur recursively</p><p>? Flagging to Data Engineering in case of data sanity issues are to be seen</p><p>? Ensure that the action insights shared with the business teams are worked upon</p><p>? Ensure new business requirements are thoroughly vetted and signed off</p><p>? Knowledge sharing within the team and outside if required</p><p><br></p><p>What are we looking for ?</p><p>? 0 to 2 years of work experience in the relevant field, preferably in a consumer facing</p><p>company</p><p>? Proficient in SQL and/or HQ, ability to handle complex/inner queries</p><p>? Hands-on with Google Sheets / Microsoft Excel (basic data cleaning, pivoting and data</p><p>exploration)</p><p>? Must have worked on any one Data Visualization Tool (Tableau, Power BI, Microstrategy,</p><p>Metabase etc)</p><p>? Basic automation skills using Google Sheets or Microsoft Excel are expected</p><p>? Working knowledge on handling data in R/Python is a plus</p><p>? Communication skills to get the business requirements and give out the final insights</p><p>? Data Inquisitiveness</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 20000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 40000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bharathir@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}