{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6148,
      "stationName": "Weekday (Dayworks pvt ltd), Bengaluru",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1767,
      "projectId": 2873,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Growth initiatives",
      "description": "<p>What will you work on?</p><p>The growth team at Weekday engages with ~20,000 companies every week across various growth initiatives, and this number is consistently growing. Your primary job will be to help us grow this number through hands-on execution of initiatives that are provably working.</p><p>Your typical week might look like this in the initial months:</p><p>1. Discovering job boards and platforms where companies that fit our ICP are hiring from</p><p>2. Researching companies and openings to identify whether or not they are a good prospect for us</p><p>3. Identifying relevant PoCs at target companies, enriching lead lists with their contact information, and processing prospect data</p><p>4. Preparing and sending ad-hoc outbound campaigns</p><p>5. Regularly monitoring fundraising activity and emerging startups to identify prospects</p><p>6. Maintaining a record of growth experiments and related metrics to ensure visibility and trackability</p><p>7. Ad-hoc operational tasks to keep the growth engine running</p><p>You will be a good fit if:</p><p>1. You have 6-12 months of experience in a startup environment and are looking to dive deeper into hands-on execution in a fast paced setup. If you’re an exceptional fresh grad, we are flexible.</p><p>2. You can work with basic SQL queries and are tech-savvy enough to quickly learn how to use tools like Airtable, Sendgrid etc.</p><p>3. You have high ownership and the ability to work efficiently and get things done.</p><p>4. You are able to work with high operational rigour and attention to detail</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "arindam.roy@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}