{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6313,
      "stationName": "Wissen Infotech",
      "stationCity": "Bng",
      "businessDomain": "CSIS/IT",
      "problemBankId": 2084,
      "projectId": 3268,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Intelligent Document Processing and Solution Generation Agents",
      "description": "<p><span style=\"color: rgb(0, 0, 0);\">The intern will develop agentic workflows to streamline business processes by creating intelligent agents capable of analyzing extensive requirement documents, identifying critical tasks, and generating tailored solutions. These agents will leverage Large Language Models (LLMs) through frameworks like Langchain or Langgraph, integrating tools for Retrieval-Augmented Generation (RAG), web and database searches. This project aims to build a system that references historical project data and documents to deliver accurate, context-aware recommendations. Proficiency in Python, deep learning, and LLM handling is essential for developing these sophisticated, autonomous agents.</span>\t</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 30000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "muthug@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6313,
      "stationName": "Wissen Infotech",
      "stationCity": "Bng",
      "businessDomain": "CSIS/IT",
      "problemBankId": 2084,
      "projectId": 3271,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Multi-Source Predictive Analytics and Forecasting Platform",
      "description": "<p><span style=\"color: rgb(0, 0, 0);\">This project aims to create a robust forecasting platform capable of integrating diverse data sources, including sales transactions, product and user databases, and external data streams like weather and financial indicators. The platform will generate highly accurate, multi-dimensional forecasts, catering to varied forecasting needs across the organization. The solution will implement sophisticated time-series models and leverage machine learning techniques to produce reliable projections, empowering data-driven decision-making for supply chain, inventory, and sales strategies. Required skills include data engineering, time-series analysis, cloud platforms, and machine learning.</span></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 30000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "muthug@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}