{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5881,
      "stationName": "Synergiz Global - Civil",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1380,
      "projectId": 2385,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Digital Project Management Implementations in Infrastructure Projects",
      "description": "<p>Description: Synergiz Global is a Project management consultancy for large scale infrastructure</p><p>projects including Highspeed rail, metro rail and airports sector. The firm is owned by BITS alumni and</p><p>is currently managed by multiple BITSIANS. Our vision is to provide innovative project management</p><p>techniques and digital solutions to bridge the gap in our construction industry. We are currently</p><p>developing and implementing our in-house project management tools. We are planning to train you on</p><p>these tools and enhance your knowledge for the future endeavors.</p><p>Skill sets: Knowledge of CPM, PERT Analysis, Scheduling, Proficiency in MS Office majorly MS</p><p>Excel;</p><p>Traits expectation: Good Communication Skills, Team Work, Problem Solving Abilities, Analytical</p><p>thinking.</p><p>Expected learning: For civil engineers, these projects will get you hands-on experience in Primavera</p><p>P6, necessary analysis and logics defined for project success, understand the market trends in BIM</p><p>technology and its advancements. Develop a knowledge of Civil and Infrastructure domain to</p><p>understand the industry.</p><p>Specific courses required for project execution: construction project management</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 15000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 15000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}