{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5668,
      "stationName": "ST Micto - Software",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1081,
      "projectId": 1951,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Design, implement, and fine-tune generative AI models and algorithms.",
      "description": "<p>Description</p><p>You will play a vital role in developing cutting-edge generative AI solutions to address STMicroelectronics' specific use cases. This position involves close collaboration with the IT architecture team to design, implement, and fine-tune generative AI models and algorithms. Your expertise will help identify appropriate large language models (LLMs) or foundation models and adapt them for the company's needs. Your work will contribute to creating POCs, MVPs, and ultimately, scalable AI-powered solutions.</p><p>Responsibilities</p><p>• Design, develop, and implement generative AI models and algorithms tailored to specific company use cases, working with both structured and unstructured data.</p><p>• Identify and fine-tune suitable large language models (LLMs) or foundation models to achieve project goals.</p><p>• Establish and manage data pipelines essential for supporting problem-solving through generative AI techniques.</p><p>• Conduct proof of concepts (POCs) and develop minimum viable products (MVPs) to demonstrate and validate the potential of generative AI solutions.</p><p>• Collaborate effectively with the IT architecture team to ensure seamless integration of generative AI models within the company's systems.</p><p>• Design architecture to enable efficient function calls using LLMs.</p><p>• Stay updated on the latest advancements and best practices in the generative AI field.</p><p>Essential Qualifications</p><p>• Specialization in AI/ML and a deep understanding of generative AI concepts and technologies.</p><p>• Excellent English communication skills (both written and verbal).</p><p>• Strong Python programming proficiency.</p><p>• Solid understanding of natural language processing (NLP) and machine learning principles.</p><p>• Experience working with deep learning frameworks such as TensorFlow or PyTorch.</p><p>ST Restricted</p><p>• Demonstrated problem-solving aptitude and meticulous attention to detail.</p><p>• Ability to work both independently and collaboratively in a team setting.</p><p>Desirable Qualifications</p><p>• Creative and innovative mindset to explore diverse possibilities within the generative AI domain.</p><p>• Proven ability to work autonomously and demonstrate initiative within a collaborative environment.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 35000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}