{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5888,
      "stationName": "Global Medical Education and Research Foundation (GMERF)",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1400,
      "projectId": 2410,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Metagenomics analysis Title: Computational analysis of Gut Microbiome profiles in liver transplant donors and recipients",
      "description": "<p>Metagenomics is a new approach to studying the composition of microorganisms found in a specific</p><p>environment using functional gene screening. This project focuses on identification of microbial</p><p>signatures in liver transplant (LT) recipients and donors using computational and statistical analysis of</p><p>bacterial profiles of 16S rRNA sequencing with Bioinformatics tools and by using QIIME 2 advanced</p><p>software. Alpha and Beta diversity indices assess the bacterial composition at various taxonomic</p><p>levels such as Phylum, Class, Order, Genus, and Species.</p><p>Computational screening helps us understand the variations in the intestinal microbial signatures of</p><p>LT recipients and, is recognized as an early target for therapeutic intervention during the post-LT</p><p>period. The methodology involves a series of steps such as cleaning the FASTq raw sequence data files,</p><p>removing first the overlapping sequences, and then chimeras, followed by clustering of quality filtered</p><p>unique sequences, and finally sorting them into taxonomic classification using operational taxonomic</p><p>units (OTUs) analysis pipeline. Handling the online Bioinformatics pipelines in this project benefits the</p><p>students to adopt dexterous usage of the metagenomics pipeline in identifying gut microbiome</p><p>signatures among LT patients.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 10000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 10000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "shailjasodhi@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5888,
      "stationName": "Global Medical Education and Research Foundation (GMERF)",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1400,
      "projectId": 2411,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Development of Microfluidic Device (MFD): Title: Design and Fabrication of a Microfluidic Device for Biomedical Applications",
      "description": "<p>Project Overview: This project involves designing, and fabricating a microfluidic device for biomedical</p><p>applications, utilizing CAD software for design and soft lithography techniques with materials like</p><p>PDMS for construction. The device's performance will be tested through flow tests. Required skills</p><p>include proficiency in CAD software, microfabrication techniques, and microscopy, along with, basic</p><p>laboratory and analytical skills. Effective communication, teamwork, and time management are also</p><p>essential. By the project's end, students will have hands-on experience in microfluidic device</p><p>fabrication and testing, equipping them with skills relevant to biomedical engineering.</p><p>Project Deliverables:</p><p>? A fully functional microfluidic device prototype.</p><p>? A comprehensive report detailing the design process, fabrication methods, testing procedures</p><p>and results.</p><p>? A presentation summarizing the project’s objectives, methodology, findings, and potential</p><p>applications.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 10000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 10000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "shailjasodhi@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5888,
      "stationName": "Global Medical Education and Research Foundation (GMERF)",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1400,
      "projectId": 2412,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Genetic association studies (GAS):Title: Role of DNA markers in identifying the association with disease pathogenesis",
      "description": "<p>Genome studies enable the discovery, and characterisation of genetic mutations/variations associated</p><p>with a specific disease. Currently, we are working on identifying the molecular signaling pathways</p><p>involved in the pathogenesis of diseases such as asthma, a chronic inflammatory lung disease;</p><p><br></p><p>Parkinson’s disease, a late-onset neurodegenerative disease; Premature Ovarian Failure, an infertility-</p><p>related reproductive disease; and Liver cirrhosis, a liver disease. Biomarker identification is carried out</p><p><br></p><p>using different techniques, such as DNA/RNA isolation, Agarose Gel Electrophoresis, PCR, PCR-RFLP,</p><p>and RT-PCR including primer designing.</p><p>Students will receive training on different hands-on molecular techniques, equipping them with the</p><p>skills required to independently manage tasks at bench-side.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 10000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 10000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "shailjasodhi@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5888,
      "stationName": "Global Medical Education and Research Foundation (GMERF)",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1400,
      "projectId": 2413,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Identification of Sepsis Biomarkers Title: Identifying the Role of Molecular and Regulatory Cell Death Biomarkers in Sepsis Pathophysiology",
      "description": "<p>Sepsis is a life-threatening organ dysfunction caused by dysregulated host response to</p><p>infection. The pathophysiology of sepsis is quite complex and involves multiple organ</p><p>systems. We train the students starting from DNA/RNA isolation, serum protein estimation</p><p>by ELISA, real-time PCR (RT-PCR), and the estimation of protein biomarkers by Western</p><p>Blotting techniques.</p><p>The project aims to (a) investigate the role of molecular biomarkers that are involved in the</p><p>cell death mechanisms signalling pathways such as apoptosis, necroptosis, pyroptosis, and</p><p>autophagy pathways in sepsis, (b) to establish the regulatory mechanisms (Regulatory T-cells)</p><p>governing sepsis-induced immune cell death, and (c) developing a multiple marker diagnostic</p><p>panel using microfluidics technology.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 10000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 10000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "shailjasodhi@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}