{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5117,
      "stationName": "KPMG,Chennai",
      "stationCity": "Chn",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1298,
      "projectId": 2273,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "KPMG",
      "description": "<p>We are seeking a motivated and detail-oriented intern to join our Government Advisory team, focusing</p><p>on Education and Skilling. This role provides a unique opportunity to gain hands-on experience in policy</p><p>analysis, project management, and strategic planning within the government sector. The intern will</p><p>assist in research, data analysis, and the development of recommendations to enhance educational and</p><p>skilling initiatives.</p><p>Key Responsibilities:</p><p>- Research and Analysis</p><p>- Conduct comprehensive research on education and skilling policies, programs, and best practices.</p><p>- Analyze data and trends to support policy recommendations and project planning.</p><p>- Prepare reports, policy briefs, and presentations based on research findings.</p><p>- Project Support:</p><p>- Assist in the planning, coordination, and implementation of education and skilling projects.</p><p>- Collaborate with team members and stakeholders to ensure project objectives are met.</p><p>- Support the development and monitoring of project timelines, deliverables, and budgets.</p><p>- Stakeholder Engagement:</p><p>- Assist in organizing meetings, workshops, and consultations with government officials, educational</p><p>institutions, and other stakeholders.</p><p>- Document and summarize key discussions and action items from stakeholder engagements.</p><p>- Administrative Tasks:</p><p>- Provide administrative support to the team, including scheduling meetings, managing</p><p>communications, and maintaining project documentation.</p><p>- Assist in preparing materials for presentations, meetings, and other events.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ramesh.venkatraman@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}