{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6312,
      "stationName": "Mokshagna Technolgoies Pvt. Ltd (Remit2Any)",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2077,
      "projectId": 3256,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Acquisition Product Management Intern - Remit Money, Title: Activation Product Management Intern - Remit Money, Title: Retention Product Management Intern - Remit Money (Customers)",
      "description": "<p>Title: Acquisition Product Management Intern - Remit Money</p><p>Description:</p><p>You will be responsible for developing and implementing digital marketing</p><p>strategies to drive user acquisition for the Remit Money platform. The role involves</p><p>collaborating with marketing agencies, creating compelling content, and</p><p>leveraging AI platforms to generate quality funnels. You’ll focus on organic user</p><p>acquisition through content marketing and user-generated content. Additionally,</p><p>you will be responsible for attributing user growth to the right channels and</p><p>ensuring the platform throttles effectively to maximize user acquisition.</p><p>Responsibilities:</p><p>? Develop and execute digital marketing strategies</p><p><br></p><p>? Collaborate with agencies to ensure campaigns are on track</p><p>? Focus on content marketing and user-generated content</p><p>? Devise content strategies to attract users organically</p><p>? Leverage AI platforms to create quality acquisition funnels</p><p>? Attribute user growth to the right marketing channels</p><p>? Ensure throttling on the most effective platforms to optimize user growth</p><p>Skills Needed:</p><p>? Knowledge of digital marketing and content creation</p><p>? Experience with content strategy</p><p>? Strong collaboration and communication skills</p><p>? Basic understanding of AI platforms for marketing</p><p>? Ability to analyze user acquisition data and attribute growth to specific</p><p>channels</p><p>? Experience with analytics frameworks (Google analytics + clarity)</p><p><br></p><p>Project 3</p><p><br></p><p>Title: Activation Product Management Intern - Remit Money</p><p>Description:</p><p>You will focus on ensuring users are successfully onboarded and complete their</p><p>first transaction. This role requires close collaboration with support teams to</p><p>address user concerns quickly and efficiently. You will also work on improving the</p><p>user journey from sign-up to the first transaction, ensuring seamless activation.</p><p>Responsibilities:</p><p>? Own the funnels along with other PMs in your Team</p><p>? Collaborate with support teams to resolve user issues and improve</p><p>onboarding</p><p>? Ensure that users complete their first transaction</p><p>? Streamline the onboarding process to reduce friction</p><p>? Identify and address pain points in the activation funnel</p><p>Skills Needed:</p><p>? Strong understanding of product management and user flows</p><p>? Ability to collaborate with cross-functional teams (support, tech)</p><p>? Problem-solving and communication skills</p><p>? Experience in improving user activation and transaction rates</p><p><br></p><p>Project 4</p><p><br></p><p>Title: Retention Product Management Intern - Remit Money (Customers)</p><p>Description:</p><p>You will be responsible for analyzing user cohorts and driving strategies to</p><p>increase return transactions. This role involves deep data analysis to identify</p><p>patterns in user behavior and devising initiatives that ensure users return to the</p><p>platform for repeat transactions. You’ll also collaborate with marketing and</p><p>product teams to develop retention campaigns.</p><p>Responsibilities:</p><p>? Analyze user cohorts and transaction patterns to identify retention</p><p>opportunities</p><p>? Develop strategies to increase repeat transactions</p><p>? Collaborate with marketing to create retention campaigns</p><p><br></p><p>? Monitor key metrics related to user retention and transaction frequency</p><p>Skills Needed:</p><p>? Proficiency in data analysis and cohort studies</p><p>? Understanding of user retention strategies</p><p>? Strong analytical and problem-solving skills</p><p>? Collaboration skills to work with marketing and product teams</p><p><br></p><p>Project 5</p><p><br></p><p>Title: Product Management Intern - Remit Money (Business)</p><p>Description:</p><p>You will help streamline cross-border transfers for businesses by managing the</p><p>product roadmap for our B2B platform. The role involves working closely with</p><p>stakeholders to build a seamless solution that addresses the needs of businesses</p><p>and partners worldwide, focusing on stability, compliance, and operational</p><p>efficiency.</p><p>Skill Sets:</p><p>? Experience in product development or management</p><p>? Analytical skills to understand business needs</p><p>? Knowledge of cross-border payments and compliance (preferred)</p><p>? Proficiency with project management and collaboration tools</p><p>? Strategic thinking and problem-solving skills</p><p>Traits Expectation:</p><p>? Strong leadership and decision-making ability</p><p>? Customer-focused mindset</p><p>? Strategic thinker with attention to detail</p><p>Expected Learning:</p><p>? Practical experience in managing a B2B product in fintech</p><p>? Exposure to cross-border payments and compliance</p><p>? Hands-on experience in product development</p><p>Specific Courses Required for Project Execution:</p><p>? Product Management or Business Strategy</p><p>? International Finance or Cross-Border Payments</p><p><br></p><p>Project 6</p><p><br></p><p>Title: Product Management Intern - Investment Product</p><p>Description:</p><p>You will manage the product lifecycle of a new investment product that gives NRIs</p><p>access to crypto investments with an expected 12% IRR. The role involves market</p><p>research, feature development, and aligning business objectives with customer</p><p>needs.</p><p>Skill Sets:</p><p>? Strong interest in investment and fintech products</p><p>? Analytical skills to conduct market research</p><p>? Knowledge of crypto investments and stablecoins</p><p><br></p><p>? Familiarity with financial compliance and regulatory requirements</p><p>Traits Expectation:</p><p>? Entrepreneurial mindset</p><p>? Ability to prioritize and execute quickly</p><p>? Strong communication skills</p><p>Expected Learning:</p><p>? Understanding of crypto investments and financial product development</p><p>? Exposure to managing high-value investment products</p><p>? Market research and product positioning experience</p><p>Specific Courses Required for Project Execution:</p><p>? Investment Management or Financial Products</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 25000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 25000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}