{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5066,
      "stationName": "Adecco India,Bengaluru",
      "stationCity": "Bng",
      "businessDomain": "Others",
      "problemBankId": 1443,
      "projectId": 2484,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project 1  Title: Data Analyst: “Enhancing Price Prediction with XGBoost”, Project 2  Title: Process Analyst “Navigating the Pricing Landscape: Process & Data Approach",
      "description": "<p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Project 1</strong></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Title: Data Analyst: “Enhancing Price Prediction with XGBoost”</strong></p><p><strong style=\"color: rgb(0, 0, 0);\">Description: In the 2nd semester of 2023-24, a team of talented Computer Science students developed an innovative Price Prediction Algorithm using Python and XGBoost. Now, as a Data Analyst, your mission is to take over this codebase and elevate it to new heights. Here’s what awaits you:</strong></p><ol><li><strong style=\"color: rgb(0, 0, 0);\">Simplification and Modularity: Streamline the existing code, making it more elegant and maintainable. Break down complex components into modular functions for better readability.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Explainability: Dive deep into the algorithm’s inner workings. Uncover the “why” behind predictions by visualizing feature importance and model behavior. Explain it to stakeholders in a way that even non-technical folks can grasp.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Optimization: Fine-tune the technical parameters of the XGBoost model. Explore hyperparameter tuning techniques to squeeze out every ounce of performance.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Presentation Magic: Leverage Microsoft Co-Pilot to create stunning visualizations and simplified output formats. Transform raw predictions into actionable insights that decision-makers can easily digest.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Automation Roadmap: Chart a course towards full automation. Imagine a workflow where price optimizations happen seamlessly, driven by data and algorithms. Your task is to make this vision a reality.</strong></li></ol><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Expected learning:&nbsp;</strong></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Specific courses required for project execution:&nbsp; engineering</strong></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Project 2</strong></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Title: Process Analyst “Navigating the Pricing Landscape: Process &amp; Data Approach</strong></p><p><strong style=\"color: rgb(0, 0, 0);\">Description: As a Pricing Process Analyst, you’ll embark on a fascinating journey through the intricate world of pricing. Here’s what awaits you:</strong></p><ol><li><strong style=\"color: rgb(0, 0, 0);\">Process Evaluation: Dive into various pricing processes—each a unique puzzle waiting to be solved. Evaluate their efficiency, identify bottlenecks, and propose improvements.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Data Exploration: Unearth hidden gems within diverse datasets. Understand the nuances of pricing data across different markets. Your insights will be the compass guiding strategic decisions.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Technical Solutions: Designing or Evaluating cutting-edge tools and techniques. Whether it’s statistical models, machine learning, or optimization algorithms, you’ll be the architect of pricing excellence.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Documentation Mastery: Collaborate closely with Solution Analysts. Document processes, data flows, and landscape intricacies. Your work will be the treasure map for future explorers.</strong></li><li><strong style=\"color: rgb(0, 0, 0);\">Business Acumen: Your engineering background meets business acumen. Understand market dynamics, customer behavior, and competitive landscapes. Translate data into actionable insights.</strong></li></ol><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Expected learning:</strong></p><p class=\"ql-align-justify\"><br></p><p><strong style=\"color: rgb(0, 0, 0);\">Specific courses required for project execution: management or engineering.</strong></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 75000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 75000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anita.ramachandran@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}