{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3142,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Total No -2,3,7 Project - Details given below",
      "description": "<p>Project 2 Title: Techniques in ultra-low field NMR</p><p>Description: Zero to ultra-low field NMR (ZULF NMR) is an emerging spectroscopic technique with the</p><p>potential to complement traditional NMR methods. We are investigating the application of ZULF NMR</p><p>to in situ studies of electrolysis processes in alkaline batteries. By analyzing the electrochemical</p><p>reactions and molecular dynamics within the battery, this research aims to gain deeper insights into the</p><p>charging and discharging mechanisms and identify opportunities for enhancing battery performance.</p><p>Skill sets: Basic optics, electronics, matlab/python, quantum mechanics</p><p>Traits expectation: Interest towards instrumentation, patients for systematic studies, entrepreneurial</p><p>aspiration</p><p>Expected learning: Techniques in optical instrumentation and NMR methodologies</p><p>Specific courses required for project execution: Physics, Quantum physics, Optics, Electronics.</p><p>Project 3 Title: Development and automation of interferometric autocorrelator for ultrashort pulse measurement</p><p>Description: Direct measurement of ultrashort pulse duration using photodetection is often limited by</p><p>the response time of the detector. The typical best-case, picosecond rise-times of the commercially</p><p>available photodetectors cannot be readily used to measure the duration of shorter pulses. The primary</p><p>goal of this project is to learn and build an interferometric setup to measure optical pulse duration in the</p><p>picosecond-femtosecond time-scales using the autocorrelation technique. Further, it also involves</p><p>characterization, optimization, automation and testing of the interferometric autocorrelator.</p><p>Skill sets: Basic optics, engineering, Labview, mechanical design tools (CAD)</p><p>Traits expectation: Interest towards instrumentation, diagnostic building, problem solving attitude,</p><p>entrepreneurial aspiration.</p><p>Expected learning: Ultrafast optical measurement techniques</p><p>Specific courses required for project execution: Physics/Engineering/Optics/Ultrafast Optics/Optical</p><p>Engineering/Photonics</p><p>Project 7 Title: Femtosecond laser driven structuring of liquid flows</p><p>Description: Liquid flows are ubiquitous in nature with applications in fluid dynamics, micromachining</p><p>industry or in medicine and bio science. Often, on demand shapings of liquid flows are required to</p><p>address a specific problem, which could involve planar sheets, cylindrical jets, spherical droplets. This</p><p>project aims to understand and develop the structuring of these 1-d, 2-d and 3-d liquid structures with</p><p>femtosecond lasers.</p><p>Skill sets: Basic optics, engineering, Python programming.</p><p>Traits expectation: Ultrafast lasers, Optomechanics, optofluidics.</p><p>Expected learning: Femtosecond lasers, fluid flow, ultrafast dynamics.</p><p>Specific courses required for project execution: Fluid Mechanics/Engineering/Optics</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3143,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project No - 4 & 6 for Chemistry/engineering",
      "description": "<p>Project 4 Title: Synthesis of polymer composite membranes for for hydrocarbon separation</p><p>Description: State of the art polymer membranes lack sufficient efficacy (permselectivity) to replace</p><p>energy intensive distillation methods. Our aim is to strategise and fabricate high flux and selective</p><p>composite membranes, which are sustainable. We aim to fabricate and test the membrane performance</p><p>in lab-made gas permeation set up.</p><p>Skill sets: organic synthesis, chemical engineering</p><p>Traits expectation: Interest in material chemistry</p><p>Expected learning: membrane design and synthesis, material characterization techniques</p><p>Specific courses required for project execution: chemistry or chemical engineering background</p><p><br></p><p>Project 6 Title: Computational modeling of atmospheric molecular processes</p><p>Description: The lifetime of the molecules in atmospheric conditions depend on their solvated</p><p><br></p><p>microstructure that are dynamic. The project will survey some of the pollutants such as sulfate ions, free-</p><p>radicals, volatile organic compounds, etc. Selected methods based on computational chemistry (density</p><p><br></p><p>functional theory) and machine learning will be applied to model the dynamical composition of these</p><p>molecules.</p><p>Skill sets: Able to work with Linux environment, plotting with Python/Matplotlib, Basic physical chemistry</p><p>Traits expectation: Interest in reviewing project-related literature and atmospheric chemistry, Interested</p><p>in discussions with PhD students.</p><p>Expected learning: Atmospheric chemistry, computational chemistry, application of machine learning</p><p>Specific courses required for project execution: Python programming, Physical chemistry</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3144,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project No-13",
      "description": "<p>Project</p><p>13</p><p>Title: Design &amp; Analysis of Vacuum Chambers</p><p>Key Responsibilities:</p><p>• Design and develop high throughput Data acquisition systems for capturing, real-time analysis and</p><p>storing multivariate data stream from experiments.</p><p>• Design, analysis, manufacture and assembly of vacuum chambers</p><p>• Manufacturing drawings</p><p>• GD&amp;T</p><p>• Structural analysis</p><p>Preferred skills:</p><p>• Pursuing BTech or MTech in Mechanical Engineering.</p><p><br></p><p>• Should know the basics in mechanical subject viz., Strength of Material, Dimensions and Tolerance</p><p>etc.</p><p>• Should know SolidWorks software for making 3d models and manufacturing drawings as well</p><p>• Should be interested in setting up the lab as well as supporting the ongoing experiments</p><p>Value addition for the intern:</p><p>• Design and analysis of vacuum chambers</p><p>• 3d modelling and manufacturing drawings</p><p>• Exposure to the assembly of mechanical systems and vacuum integrity testing of chambers</p><p>• Exposure to precision experiments in the lab</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3145,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project no -11 & 12 for Electronics",
      "description": "<p>Project</p><p>11</p><p>Title: Electronics and Automation for Data acquisition systems</p><p>Key Responsibilities:</p><p>• Design and develop high throughput Data acquisition systems for capturing, real-time analysis and</p><p>storing multivariate data stream from experiments.</p><p>• Development of timing and trigger circuits for lasers and data acquisition systems.</p><p>• Automation of control systems and hardware used for Laser-matter interaction experiments.</p><p>• High speed Image capture and analysis.</p><p>• Development of control electronics and automation of kinematic linear and rotation travel stages.</p><p>Preferred skills:</p><p>• Pursuing BTech or MTech in the field of Electronics, Photonics or Optical Engineering.</p><p>• Programming and electronics hardware interface experience using C, C++, Python, MATLAB,</p><p>LabVIEW or similar programming languages.</p><p>• Experience with EDA tools like Eagle/ Altium designer.</p><p>• Experience with PCB Design.</p><p>• Knowledge of microcontrollers and its protocols like SPI,I2C,etc</p><p>• Knowledge of power supplies, measurement and analytical instruments like oscilloscope, function</p><p>generator etc.</p><p>• Good interpersonal skills, with the ability to understand and communicate project overviews as well</p><p>as in-depth details.</p><p>Value addition for the intern:</p><p>• An opportunity to work with a multidisciplinary research team working on various problems in the field</p><p>of intense laser matter interaction, particle acceleration, nonlinear optics and coherent light sources.</p><p>• Training in design and development of complex electronics and control systems for experimental rigs</p><p>comprising of lasers, timing circuits, detectors and data acquisition systems.</p><p>• Training in capture, analysis and handling of complex data streams from experimental rigs.</p><p>Project</p><p>12</p><p>Title: Instrumentation control &amp; Automation</p><p>Key Responsibilities:</p><p>• Digital and Analog electronics</p><p>• Microcontrollers</p><p>• IOTs</p><p>• Advanced VLSI Design</p><p>Preferred skills:</p><p>• Pursuing BTech or MTech in the field of Electronics</p><p>• Programming and electronics hardware interface experience with exposure in Field instrumentation,</p><p>Control systems, LabVIEW, PLC, DCS &amp; SCADA systems, with preferable programming experience</p><p>in multiple languages: C, C++, Python.</p><p>Value addition for the intern:</p><p>• Development of end-to-end engineering solutions for Instrument Control and Automation from</p><p>planning to design to implementation and documentation, collaborating with a team of scientists and</p><p>engineers.</p><p>• Undertaking relevant research, producing and implementing designs.</p><p>• Calibrating products and instruments, creating test procedures, modifying and re-evaluating.</p><p>• Data Analysis and Interpretation.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3146,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project No-14 for Computer science",
      "description": "<p>Project</p><p>14</p><p>Title: Control systems development for lab devices</p><p>Key Responsibilities:</p><p>• To develop control systems for lab devices which include microscopes, motor control, vacuum and</p><p>gas systems.</p><p>• This diverse array of devices will suit a person with a wide range of programming experience in</p><p>hardware and instrumentation control</p><p>Preferred skills:</p><p>• Pursuing BTech or MTech in the field of Computer Science/IT.</p><p>• Demonstrable experience in Python programming language</p><p>• Linux operating system experience</p><p>Value addition for the intern:</p><p>• A good understanding of scientific instruments (e.g. Oscilloscopes, Power supplies, delay generators</p><p>etc.,)</p><p>• Experience with the scientific Python ecosystem</p><p>• Exposure to Git-based workflow (branches, issues, code review, pull requests)</p><p>• Understanding of modern Software Development life cycles.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3147,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project No-1 & 8 for Biology",
      "description": "<p>Project 1 Title: Developing single molecule techniques to study phase separation of biomolecules</p><p>Description: Phase separation of proteins and other biomolecules plays important roles in cellular</p><p>functions and diseases. However, investigation of these processes in the earliest phase, although</p><p>critically important, is difficult. Therefore, it is necessary to develop single molecule sensitive techniques</p><p>that can help visualize and characterize these events. We are working to develop microscopy and</p><p>spectroscopy techniques to characterize the liquid liquid phase separation of proteins such as tau protein</p><p>that are involved in the pathology of diseases such as Alzheimer’s and Parkinson’s disease.</p><p>Skill sets: knowledge of physics, coding, electronics, engineering</p><p>Traits expectation: interest in building techniques, coding and data analysis</p><p>Expected learning: experience with developing state of the art methodologies in biophysical experiments</p><p>Specific courses required for project execution: physics and/or engineering courses</p><p><br></p><p>Project 8 Title: Determinants of Mammalian origin of replication selection</p><p>Description: In eukaryotes, replication initiation is determined by two temporally decoupled sequential</p><p>steps; replication origin licensing and firing. During origin licensing, it is estimated that many thousands</p><p>of sites are bound by inactive replicative helicases in each human cell. However, no discernible</p><p>sequence or proteomic profile has been conclusively attributed to origin sites in mammalian cells.</p><p>Influence of DNA structure and epigenetic context on the origin selection and replication timing will be</p><p>explored.</p><p>Skill sets: Understanding of DNA and protein structure and interactions.</p><p>Traits expectation: Interested in DNA replication and repair.</p><p>Expected learning: Cell culture, DNA fibre, flow cytometry, genome editing.</p><p>Specific courses required for project execution: Biochemistry, Molecular biology</p><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3148,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project NO - 10 for Biology",
      "description": "<p>Project</p><p>10</p><p>Title: Structural Characterization of Aggregating and Phase Separated Proteins</p><p>We are interested in the structural characterization and structural differentiation of amyloids formed by</p><p>the wt- and the mutant p53 DNA binding domain. p53 is a transcription factor that inhibits genes required</p><p>for cell cycle progression and activates genes leading to apoptosis. The function of p53 is to prevent the</p><p>cell from becoming cancerous by controlling its cell division. Thus, mutations in p53 can lead to loss of</p><p>function and the progress of cancer in about 50% of reported human cancers. The aggregates of p53</p><p>have been observed in malignant cancers. Cell models have been used to demonstrate the loss of</p><p>function and onset of tumors during p53 amyloid formation. p53 is a 393 amino acid long protein with</p><p>three major domains: N-terminal transcription activation domain (TAD), core DNA binding domain (DBD)</p><p>and tetramerization domain (TD). Cancers reported with p53 mutations have a higher frequency of</p><p>mutations in the DBD of p53. The outcome of all these mutations is the inability of p53 to bind to its</p><p>target DNA sequence. Some of these mutations also show enhanced aggregation tendencies. This</p><p>mutated p53 can seed the in-vivo wt-p53 to form aggregates, a prion-like property. The project involves</p><p>mainly use of magic angle spinning Nuclear Magnetic Resonance (NMR) and possibly solution-state</p><p>NMR, combined with other structural and biophysics techniques to characterize the structure of p53</p><p>amyloids. Further proton detected solid-state NMR methods development may become part of the</p><p>project depending on the candidate’s interest.</p><p>Skill sets: Principles of Biophysics and biochemistry, protein expression and purification, passion for</p><p>solving puzzles.</p><p>Traits expectation: ability to work, analyze data and solve problems with focus on understanding and</p><p>desire for details.</p><p>Expected learning: p53 protein handling and biophysics, overexpression and purification of protein, NMR</p><p>spectroscopy for structural characterization of amyloid, NMR data analysis.</p><p><br></p><p>Specific courses required for project execution: Basic Mathematics, understanding of amino acids and</p><p>Protein science, ability to work on computer.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6247,
      "stationName": "Tata Institute of Fundamental Research",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1987,
      "projectId": 3149,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project - 5 & 9 chemistry/physics/chemi cal engineering/materials science",
      "description": "<p>Project 5 Title: Understanding the mechanism of Li-ion intercalation in multilayer graphene sheets</p><p>Description: Lithiated graphitic materials are employed as anodes in several Li-ion based batteries. In</p><p>this project we will study how Li-ions intercalate inside multilayer graphene. For this study we will employ</p><p>molecular dynamics simulations based on density functional theory (ab initio molecular dynamics) and</p><p>machine learned force field parameters.</p><p>Skill sets: Basic knowledge of linux commands, quantum mechanics, and statistical mechanics. Basic</p><p>knowledge of molecular dynamics will be a plus.</p><p>Traits expectation: Interest in computational materials science</p><p>Expected learning: machine learned force fields, electronic structure based simulations</p><p>Specific courses required for project execution: computational chemistry / physics or equivalent</p><p>engineering course</p><p>Project 9 Title: Tailoring Spin Physics for Designing Novel Nuclear Magnetic Resonance Pulse sequences</p><p>The ability of NMR as an analytical technique to obtain atomic level details of molecules is limited by</p><p>our ability to tailor the synchrony of radiofrequency pulses and evolution of spin-spin interactions. The</p><p>design of new pulse sequences is embedded in the nuclei spin physics and their interactions with the</p><p>surroundings. In this project we aim to design pulse sequences for extracting relaxation parameters of</p><p>spin-1 quadrupolar nuclei that reveal details of site-specific molecular motions.</p><p>Skill sets: Basic understanding of Physics/Chemistry concepts, basic programming skills in any</p><p>language .</p><p>Traits expectation: ability to work, analyze data and solve problems with focus on understanding and</p><p>desire for details.</p><p>Expected learning: NMR spectroscopy, structural and dynamics characterization of molecules</p><p>Specific courses required for project execution: Mathematics, Mathematical Physics, quantum</p><p>mechanics, Basic programming in any language</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}