{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4935,
      "stationName": "UBS- QRM, Mumbai",
      "stationCity": "Mum",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1243,
      "projectId": 2212,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "QRM – Intern",
      "description": "<p>QRM – Intern</p><p><br></p><p>Your role</p><p>Do you want to build record of driving lasting business impact by developing state-of-the-art quantitative models,</p><p>applications, and strategies? Are you an expert of the market, client needs and best practice application of trading,</p><p>investment, and risk processes?</p><p>At UBS, we re-imagine the way we work, the way we connect with each other – our colleagues, clients, and</p><p>partners – and the way we deliver value. Being agile will make us more responsive, more adaptable, and ultimately</p><p>more innovative.</p><p>Your team</p><p>You’ll be an integral part of Valuation Controlling Services Team based at Business Solutions Center.</p><p>The team focusses on calculation, control, review &amp; filing of key regulatory requirements e.g. Model and Bid-Offer</p><p>reserves. Independent Price verification and Fair Value Hierarchy determination.</p><p>You’ll be working in the Global Quantitative Risk Modelling(QRM) department in Mumbai which has global</p><p>footprint spread across different geographies (Zurich, London, Poland etc).</p><p>We develop and maintain the risk measurement models across the Investment Banking division within the UBS</p><p>Group. The quantitative methods we use are closely related to sophisticated pricing models and statistical tools.</p><p>You will have the opportunity to coordinate and become the main global contact for the improvement of</p><p>methodologies, processes and parameterization of our credit exposure measures for the banking and trading book.</p><p><br></p><p>Your Expertise</p><p>You have:</p><p>• Strong Quantitative background with degree in engineering, finance, mathematics, science, or other numerical</p><p>discipline</p><p>• For engineering and statistical students financial and risk electives, certifications (like CFA, FRM, CQF etc) or any</p><p>other equivalent courses is ‘highly preferred’.</p><p>• Strong analytical skills and the ability to apply techniques from numerical analysis, statistics, and financial</p><p>mathematics to solve practical problems.</p><p>• Understanding of high-level programming language skills like Python, R, SQL(must have). Proficiency in C++,</p><p>Java or C# is an advantage(good to have).</p><p>• Knowledge of statistical modelling is ‘highly preferred’.</p><p>• Excellent communication and coordination skills with colleagues and stakeholders at all levels in the</p><p>organization i.e. team-orientated, while able to complete tasks independently</p><p>• Showing high standards when it comes to report writing in a structured way and explain technical topics clearly</p><p>and intuitively to non-technical audiences.</p><p><br></p><p>You are:</p><p>• Self-driven and pro-active in taking new initiatives.</p><p>• Ability to deliver responsibly with high quality standards.</p><p>• Skilled giving and receiving constructive feedback able to explain technical topics clearly and intuitively to a</p><p>non-technical audience.</p><p>• Fluent in English, both in oral and written form.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "niranjanswain@hyderabad.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}