{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5576,
      "stationName": "Bitespeed - Founder's Office",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1976,
      "projectId": 3130,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Customer Success Intern",
      "description": "<p>Description: As a Customer Success Intern at BiteSpeed, you'll be expected to</p><p>manage a steady stream of customer queries, applying pre-set solutions from our</p><p>database to the issues. This role involves responding to a high volume of</p><p>inquiries, logging each interaction, and ensuring strict compliance with our</p><p>support guidelines. You'll track issues, forward tickets to other teams, and follow</p><p>up as needed. The position requires consistent documentation, long hours in the</p><p>CRM, and adherence to routine protocols. Ideal for someone comfortable with</p><p>predictable, steady work in a structured environment.</p><p>Skill sets: Solid experience with CRM systems: Comfort navigating complex CRM</p><p>tools to find data-driven solutions. High-Volume Workflow Optimization:</p><p>Proficiency in handling concurrent, high-volume ticket queues while maintaining</p><p>efficiency and adherence to service-level agreements (SLAs). Strong multitasking</p><p>and efficiency: Manage a high volume of inquiries without compromising on</p><p>quality or speed.</p><p>Traits expectation: Detail-Oriented, Analytical Mindset, Customer-Centric</p><p>Expected learning: Enhanced Documentation Skills: Gain hands-on experience in</p><p>creating and maintaining detailed, high-quality records that meet industry</p><p>standards. Process Adherence and Compliance: Understand the importance of</p><p>strict adherence to established protocols to maintain consistency and regulatory</p><p>compliance.</p><p>Specific courses required for project execution: ( EEE F416) Digital</p><p>Communication, (EEE F432) Medical Instrumentation, (EEE F435) Digital Image</p><p>Processing, (HSS F323) Organizational Psychology</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 80000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 80000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}