{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5834,
      "stationName": "Bharat Petroleum Corporation Limited",
      "stationCity": null,
      "businessDomain": "Chemical",
      "problemBankId": 1322,
      "projectId": 2304,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Thermal coupling of highly endo- and exothermic reactions in milli- channel reactors",
      "description": "<p>Description: Heterogeneously catalyzed highly endo and exothermic reactions are typically carried out in fixed bed reactors. However, the amount of energy (input or output) involved in the reactions are huge. It inhibits the reaction conversion and selectivity, consequently the yield of the products. Hence, it is planned to couple these type reactions in an efficient manner. The use of milli- channel reactors in enables precise temperature and pressure control, for such reactions which can significantly improve reaction selectivity and yield. The high surface-to-volume ratio in these reactors promotes rapid heat exchange, reducing heat loss and improving energy efficiency.</p><p>The project aims to complete the following objectives:</p><p>Extensive literature survey on both type the reactions, their properties, and operating conditions, etc.</p><p>Develop a mathematical model for the thermally coupled reactions in milli- channel reactors.</p><p>Design of a reactor module</p><p>Skill sets: numerical methods, MATLAB, reaction kinetics</p><p>Expected learning: Application of heat and mass transfer and reaction kinetic fundamentals in industry</p><p>Specific courses required for project execution: Heat &amp; Mass Transfer, Numerical methods for chemical engineers, Reaction engineering in BECC fractionator (To reduce olefin</p><p>Numerical methods for chemical engineers, Reaction engiling</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    },
    {
      "stationId": 5834,
      "stationName": "Bharat Petroleum Corporation Limited",
      "stationCity": null,
      "businessDomain": "Chemical",
      "problemBankId": 1322,
      "projectId": 2305,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": " Project Title: Enhance olefin recovery in PFCC fractionator (To reduce olefin slippage in the PFCC LPG product stream)",
      "description": "<p>Description: The PFCC (Petro Fluid Catalytic Cracking Unit) product stream refers to a gaseous mixture comprising gases, LPG (liquefied petroleum gas), gasoline, LCO (light cycle oil), and HCO (heavy cycle oil). These components undergo separation in a fractionator column. However, the current fractionator column fails to effectively separate olefins, resulting in the undesired inclusion of these valuable olefinic products into the LPG stream. This scenario poses two primary issues: it compromises the quality of the LPG stream and leads to the loss of high-value olefinic products.</p><p>To address this challenge, enhancements to the fractionation process are essential. Implementing modifications to the fractionator column could improve the separation efficiency, ensuring that olefins are adequately isolated from the LPG stream. By optimizing the fractionation conditions, such as temperature, pressure, and reflux ratio, the column can achieve better separation performance. Furthermore, considering alternative separation techniques or incorporating additional separation units may be necessary to specifically target olefinic compounds. Technologies like adsorption or membrane separation could complement the existing fractionation process and facilitate the selective removal of olefins from the product stream.</p><p>By rectifying the inefficiencies in the separation process, not only can the quality of the LPG stream be preserved, but the recovery of valuable olefinic products can also be maximized, mitigating potential economic losses and enhancing overall operational efficiency within the PFCC unit.</p><p>Skill sets: ASPEN plus/ ASPEN HYSYS (Preliminary flow sheeting)</p><p>Expected learning: Process intensification in refining processes</p><p>Specific courses required for project execution: Flowsheeting tutorials will help in starting the project quickly</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    },
    {
      "stationId": 5834,
      "stationName": "Bharat Petroleum Corporation Limited",
      "stationCity": null,
      "businessDomain": "Chemical",
      "problemBankId": 1322,
      "projectId": 2306,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Kinetic studies of n-butane conversion to Maleic anhydride",
      "description": "<p>Description: Maleic anhydride is one of the key precursor chemicals in the chemical industry. Its key role arises from the multiple functional groups (double bond, carboxylic groups, heterocyclic ring) combined in this molecule that can be used for a broad range of chemical modifications yielding everyday chemicals we are all familiar with. Among these are fine chemicals such as carbohydrates like succinic acid or precursors for polymers like y-butyrolactone and 1,4-butanediol. More recently MA has also become an important ingredient in biodegradable plastics, one of the key developments for environmental protection in the future. Production of Maleic Anhydride (MA) from n-butane is a highly exothermic process typically carried out in a fixed bed reactor with high conversion and low concentration feed. Due to high exothermicity, operating the reactors at high yield level becomes challenging. Present work focusses on estimating the kinetics of n- butane conversion to maleic anhydride using lab scale reactor setup and using the lab conversion data for the estimation of LHHW /ER rate kinetics. Finally, using the estimated kinetics, rigorous mathematical model for fixed bed reactor</p><p>(1D and 2D) to be developed. Skill sets: numerical methods, MATLAB, reaction kinetics</p><p>Expected learning: Bench scale unit operations, mathematical modeling of petrochemical processes</p><p>Specific courses required for project execution: Heat &amp; Mass Transfer, Numerical methods for chemical engineers, Reaction engineering</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}