{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6304,
      "stationName": "Maxim AI - NON IT",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2069,
      "projectId": 3248,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project 3 Title: Go-To-Market (GTM) Intern",
      "description": "<p>Project 3 Title: Go-To-Market (GTM) Intern</p><p><br></p><p>Description:</p><p>? Assisting in developing and executing digital marketing strategies.</p><p>? Optimizing website content for SEO to drive organic traffic and improve search</p><p>rankings.</p><p>? Coordinating product launches on platforms like Product Hunt, G2, and other relevant</p><p>industry-specific forums.</p><p>? Analyze marketing performance metrics and generate reports to track the effectiveness</p><p>of campaigns.</p><p>? Helping refine messaging and communication tactics to best resonate with our target</p><p>audience.</p><p>? Convert unique, successful strategies into standardized processes for easier replication</p><p>and scaling of our go-to-market teams.</p><p>? Work across different areas like sales, content, marketing, customer success and</p><p>growth, and technical solutions.</p><p>? Collaborating with cross-functional teams, including product, engineering, and sales, to</p><p>ensure marketing efforts are aligned with product roadmaps and customer needs.</p><p>Skill sets:</p><p>? Experience with SEO optimization and digital marketing platforms.</p><p>? Previous exposure to SaaS products and GTM strategies is a plus.</p><p>Traits expectation:</p><p>? You are currently in your final year or pre-final year of a bachelor’s degree.</p><p>? You are passionate about AI and eager to dive into the latest developments in the</p><p>space.</p><p>? You're a quick learner and thrive in fast-paced, ambiguous environments.</p><p>? You have a creative mindset and enjoy brainstorming new, out-of-the-box ideas to</p><p>present and market products.</p><p>? You’re detail-oriented and take the initiative to ensure projects are completed efficiently</p><p>and effectively.</p><p>? You possess strong written and verbal communication skills and can collaborate</p><p>effectively with cross-functional teams.</p><p>Expected learning:</p><p>? Gain hands-on experience in developing and executing digital marketing strategies for</p><p>SaaS products.</p><p>? Learn the essentials of SEO optimization and how to track and analyze the</p><p>performance of digital campaigns.</p><p>? Develop skills in coordinating product launches and executing GTM strategies on</p><p>platforms like Product Hunt and G2.</p><p>? Understand how to effectively collaborate with cross-functional teams to align</p><p>marketing efforts with product goals.</p><p>? Gain insights into customer behavior and how to refine messaging to appeal to your</p><p>target audience.</p><p><br></p><p>Specific courses required for project execution: Bachelors in CS or Engineering, or a</p><p>related field.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 55000,
      "pgStipend": 55000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 110000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}