{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5298,
      "stationName": "Meesho",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1825,
      "projectId": 2934,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "About the Role  As our Intern - Product Management,",
      "description": "<p>About the Role</p><p>As our Intern - Product Management, you will run tests to check whether or not our</p><p>product features are in sync with industry trends or not. On a typical day, conduct</p><p>market research to project potential costs and issues – and suggest improvements too.</p><p>You will come up with metrics that will help us understand how to improve our Product.</p><p>You will support the Product Managers of the team to enhance the experience of our</p><p>customers using concrete numbers and statistical insights.</p><p><br></p><p>What you will do</p><p>? Use qualitative and quantitative data in the product development cycle to generate</p><p>user and market insights.</p><p>? Conduct effective A/B experiments to measure the impact of and improve the</p><p>product.</p><p>? Identify key product metrics and build tools, and dashboards to track them</p><p>continuously.</p><p>? Identify usage patterns and come up with action plans to move metrics in the right</p><p>direction.</p><p>? Ensure swift and better product decisions using data and analytics.</p><p>? Conduct user research and surveys to understand user needs and pain point</p><p><br></p><p>What you will need</p><p>? Bachelor’s degree in Engineering.</p><p>? Knowledge of basic concepts of statistics and their application in product</p><p>analytics.</p><p>? Ability to solve problems with a structured, data-driven approach.</p><p>? Aspiration to grow deep into a product role and eventually own product verticals.</p><p><br></p><p>Eligibility Criteria</p><p>1.Specialization - open to all branches</p><p>2.No standing arrears</p><p>3.Branch - B.Tech/ Integrated MTech from the target school’s batch of 2025</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 35000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}