{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4836,
      "stationName": "Eightfold AI India Pvt. Ltd.,Bengaluru/Noida",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1218,
      "projectId": 2177,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project 1    Title: Engineering Intern (Different Modules of the Eightfold.ai Product)",
      "description": "<p>Project 1</p><p><br></p><p>Title: Engineering Intern (Different Modules of the Eightfold.ai Product)</p><p><br></p><p>Description:</p><p>Eightfold offers the industry’s first AI-powered Talent Intelligence Platform to transform how</p><p>organizations plan, hire, develop and retain a diverse workforce, enabling individuals to transform their</p><p>career. At Eightfold, you get a chance to work on highly scalable distributed systems and AI platforms</p><p>spanning several TBs of data from enterprises, governments and public data sources. With candidate</p><p>and job data in the order of millions, our models are trained on aggregation of a billion data points and</p><p>our infrastructure is built to scale state of art.</p><p>Gain deep expertise in how AI is consumed and create futuristic applications that are effective in using</p><p>AI/ML to find the right career. Optimize for usability and make data driven decisions in the process. In</p><p>this process, collaborate with top notch engineers, product managers, and designers in an open,</p><p>creative environment.</p><p>A glimpse of our Tech stack - Python, Tensorflow, SQL, Bash, Ansible, React, Redux, Webpack, Apache</p><p>Spark, Solr, Docker, etc. and AWS services like EC2, Elastic Beanstalk, Amazon EMR, ECS, RDS, S3,</p><p>Redshift, Cloudformation, SNS, SQS, etc.</p><p>Eightfold is led by Ashutosh Garg, a PhD in Machine Learning/IIT Delhi alumni who managed Search</p><p>and Personalization at Google, and Varun Kacholia - IIT Bombay alumni, who led the News Feed</p><p>Ranking team at Facebook and developed YouTube Search at Google.</p><p>Skill sets:</p><p>Algorithms, Coding</p><p>Expected learning:</p><p>- Exposure to our array of tech stack - Python, Tensorflow, SQL, Bash, Ansible, React, Redux,</p><p>Webpack, Apache Spark, Solr, Docker, etc. and AWS services like EC2, Elastic Beanstalk, Amazon</p><p>EMR, ECS, RDS, S3, Redshift, Cloudformation, SNS, SQS, etc. May also have a learning on AI &amp; ML.</p><p>- Exposure to Eightfold Codebase and microservices architecture</p><p>- Opportunity to work with world-class team and leaders</p><p>- Ultimately, a chance to bag a full time offer with the company. (Do refer to our previous years’</p><p>high conversion rate and competitive compensation!)</p><p>Specific courses required for project execution: NIL</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 120000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 120000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "febin.vahab@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}