{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6309,
      "stationName": "Spanda.AI, BITS-WILP Lab, Hyderabad",
      "stationCity": "Hyd",
      "businessDomain": "CSIS/IT",
      "problemBankId": 2074,
      "projectId": 3253,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Internship Opportunity: AI Software Development Intern",
      "description": "<p>Internship Opportunity: AI Software Development Intern</p><p>Location: BITS-WILP Lab (Flexible)</p><p>Duration: 5 months 10 days (08-Jan-2025 to 18-June-2025)</p><p>Stipend: $500 to $1000 per month (depending on experience)</p><p>Eligibility: Undergraduate/Postgraduate students in Computer Science, Data Science, or</p><p>related fields</p><p><br></p><p>Role Overview:</p><p>As an AI Software Development Intern, you will play a key role in enhancing Spanda’s opensource</p><p>AI platform. This hands-on role provides a unique opportunity to collaborate with industry</p><p>experts and customers across diverse sectors.</p><p>Key Responsibilities:</p><p>? Contribute to the design, development, and deployment of Spanda’s AI platform.</p><p>? Work on real-world customer projects in industries like sports, healthcare, oil and gas,</p><p>and education.</p><p>? Develop, fine-tune, train and test AI models tailored to specific verticals.</p><p>? Collaborate with cross-functional teams to understand customer needs and deliver</p><p>optimized solutions.</p><p>? Assist in the integration of machine learning algorithms into scalable software systems.</p><p>? Conduct data analysis, preprocessing, and visualization for industry-specific use cases.</p><p>? Document the work products, findings, model performance and other relevant details</p><p>Skills &amp; Qualifications:</p><p>? Currently enrolled in a Bachelor’s/Master’s degree in Computer Science or Circuit</p><p>Branch Major</p><p>? Completion of courses in:</p><p>? Machine Learning (ML)</p><p>? Object-Oriented Programming (OOP)</p><p>? Data Structures and Algorithms (DSA) Intelligence, Data Science, or related</p><p>fields.</p><p>? Basic knowledge of Python, TensorFlow, PyTorch, or other machine learning</p><p>frameworks.</p><p>? Front end and UI/UX skills if applicable</p><p>? Familiarity with DevOps practices, including continuous integration and deployment</p><p>? Familiarity with data preprocessing, model training, and deployment pipelines.</p><p>? Interpretability - knowledge of techniques for explaining and interpreting AI model</p><p>decisions</p><p>? Strong problem-solving skills and the ability to work on diverse datasets.</p><p>? Excellent communication skills and the ability to collaborate effectively in a team.</p><p>? Passion for applying AI to solve real-world challenges in industries like sports,</p><p>healthcare, and beyond.</p><p>Good to Have:</p><p>? Experience with NLP and Generative AI</p><p>? Topics: Transformer models, text similarity, embeddings, fine-tuning</p><p>language models</p><p>? Familiarity with Retrieval-Augmented Generation (RAG)</p><p>? Topics: Vector databases, document retrieval, hybrid search</p><p>? Frontend Development Skills</p><p>? Experience with React.js, Next.js, Node.js, UI/UX principles</p><p>? Familiarity with cloud computing platforms</p><p>? Experience with AWS, Azure, Google Cloud</p><p>? Containerization and Deployment</p><p>? Knowledge of Docker, Kubernetes</p><p>? Data Science Background</p><p>? Basic understanding of data analysis, statistics, and data visualization (e.g.,</p><p>Pandas, NumPy, Matplotlib)</p><p>What You’ll Gain:</p><p>? For students who may not yet have experience with Large Language Models (LLMs),</p><p>Retrieval-Augmented Generation (RAG), or advanced AI/ML concepts, don’t worry—</p><p>training will be provided from our side.</p><p>? Work with other BITS alumnus that embarked on the same journey last year.</p><p>? Hands-on experience in developing a cutting-edge commercial AI platform.</p><p>? Exposure to customer projects in various industries, from sports analytics to</p><p>healthcare AI.</p><p>? Mentorship from experienced AI professionals and industry leaders.</p><p>? Certificate of Completion and a potential Letter of Recommendation based on</p><p>performance.</p><p>? Networking opportunities with professionals across verticals.</p><p>? Potential to work at our global offices in the US and India if travel and foreign</p><p>assignments interest you. We are also looking to expand into Europe, Middle East and</p><p>Africa in 2025.</p><p>Interview and Travel Requirements:</p><p>? Interview: Selected candidates will participate in an interview to evaluate their technical</p><p>expertise, problem-solving skills, and ability to thrive in a team setting. This step ensures</p><p>alignment with our project goals and determines if the candidate meets our</p><p>requirements.</p><p>? Travel and Accommodation: Candidates will be responsible for arranging their own</p><p>accommodation and travel for the internship.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 500,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 500,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "yvk.ravikumar@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}