{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6236,
      "stationName": "JPMC - GR&C –Model Risk Governance & Review (MRGR)",
      "stationCity": "Mum",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1927,
      "projectId": 3051,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "JPMC - GR&C –Model Risk Governance & Review (MRGR)",
      "description": "<p>As part of Risk Management and Compliance, you are at the center of keeping JPMorgan Chase strong</p><p>and resilient. You help the firm grow its business in a responsible way by anticipating new and emerging</p><p>risks, and using your expert judgement to solve real-world challenges that impact our company,</p><p>customers and communities. Our culture in Risk Management and Compliance is all about thinking</p><p>outside the box, challenging the status quo and striving to be best-in-class.</p><p>MRGR is a global team of modeling experts within the firm’s Risk Management and Compliance</p><p>organization. The team is responsible for conducting independent model validation and model</p><p>governance activities to help identify, measure, and mitigate Model Risk in the firm. The objective is to</p><p>ensure that models are fit for purpose, used appropriately within the business context for which have</p><p>been approved, and that model users are aware of the model limitations and how they could impact</p><p>business decisions.</p><p><br></p><p>Being part of the MRGR team will put you at the center of the firm’s model validation and governance</p><p>activities with exposure to a wide variety of model types and cutting edge modeling techniques, while</p><p>frequently interacting with the best and brightest in the firm. You will expand your knowledge of the</p><p>different modeling techniques used in the firm, their unique limitations, and use that knowledge to help</p><p>shape business strategy and protect the firm.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 150000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 150000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}