{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6504,
      "stationName": "Porter - Business Internship.",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2458,
      "projectId": 3723,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Business Internship ",
      "description": "<p>Job Description:</p><p>We are seeking a motivated and detail-oriented Business Intern to join our team. This role</p><p>offers a hands-on opportunity to gain experience across various business operations, including</p><p>process design and improvement, research, data analysis, project management, and strategic</p><p>initiatives. The intern will collaborate with multiple departments to support key projects,</p><p>contribute to process optimization, and help drive the company's growth through actionable</p><p>insights and data-driven decision-making.</p><p>Please Note: This internship requires 90% field work.</p><p>Responsibilities:</p><p>? Research &amp; Analysis: Conduct market research and analyze trends, competitors, and</p><p>customer data to support business strategies and decision-making. Identify new</p><p>opportunities for growth and operational improvement.</p><p>? Process Design &amp; Improvement: Develop and refine scalable processes for seamless</p><p>interactions across teams, vendors, and customers. Assist in optimizing existing</p><p>processes to enhance efficiency and performance.</p><p>? Project Support: Assist in the planning, execution, and management of business</p><p>projects. Collaborate with teams across departments on process improvements,</p><p>strategic initiatives, and key business goals.</p><p>? Data-Driven Decision Making: Gather user trends and support product and business</p><p>decision-making processes. Provide insights to inform process and product</p><p>improvements.</p><p>? Stakeholder Collaboration: Work closely with internal and external stakeholders to</p><p>drive projects forward, ensuring alignment and clear communication throughout the</p><p>process.</p><p>? Experimentation &amp; Innovation: Pilot new initiatives, analyze results, and provide</p><p>actionable insights to improve operations and business outcomes.</p><p>? Operational Support: Support the Operations and Category Heads in identifying and</p><p>addressing factors that impact fulfillment, contributing to the optimization of peak</p><p>management and supply processes.</p><p>Skills Required:</p><p>? High Ownership: A proactive, hands-on approach with a strong sense of responsibility</p><p>and accountability.</p><p>? Adaptability: Ability to embrace change and navigate ambiguity with ease.</p><p>? Communication: Strong interpersonal and communication skills to engage effectively</p><p>with diverse stakeholders.</p><p>? Problem-Solving: Ability to break down complex issues and develop practical,</p><p>actionable solutions.</p><p>? Data Analytics: Strong analytical skills with proficiency in Excel/Google Sheets, and the</p><p>ability to derive insights from data to inform business decisions.</p><p>This internship provides a unique opportunity to learn and grow within a dynamic environment,</p><p>offering exposure to multiple facets of business operations, project management, and strategic</p><p>planning. If you are eager to contribute to meaningful projects and gain experience in a</p><p class=\"ql-align-justify\">fast-paced business setting, we encourage you to apply!</p><p><strong style=\"color: black;\">Specific courses required for project execution:&nbsp;</strong><span style=\"color: black;\">Open for all Engineering streams (BE/BTECH )</span></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 40000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 40000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "sandeep.kayastha@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}