{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6283,
      "stationName": "Humantic AI",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2040,
      "projectId": 3207,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Software Engineering Intern - Fullstack/Frontend",
      "description": "<p>At Humantic AI, we are building a new 'people intelligence' segment from</p><p>scratch. Our product is at the cutting-edge of AI, Psychology and large-scale data.</p><p>We believe that we have an opportunity (and even a responsibility) to</p><p>personalise and humanize how people interact over the internet; and an</p><p>opportunity to inspire far more trustworthy relationships online than it has ever</p><p>been possible before.</p><p>We currently focus on selling ‘buyer intelligence’ to sales teams and help them</p><p>book more meetings and close more deals. Our customers include enterprises</p><p>like Cushman &amp; Wakefield, Foundever, Mitel; startups like Domo, AcuityMD,</p><p>ResourceWise and even the sales team at the legendary Manchester United!</p><p>And we have barely started!</p><p>Responsibilities</p><p>As a full stack engineering intern at Humantic AI, you will help enhance and scale</p><p>next generation people intelligence solutions.</p><p>What Really Matters</p><p>? Know how to debug an issue and navigate a large codebase. Looking at</p><p>you, GSoC students (or similar programs)</p><p>? Knowledge of using JavaScript (NodeJS) at the backend</p><p>? Good knowledge of at least one of ReactJS, JQuery or Angular</p><p>? Worked with Chrome Extensions before</p><p>? Some familiarity with SQL</p><p><br></p><p>What Matters Somewhat</p><p>? Deployment and performance tuning of web applications</p><p>? Knowledge of HTML5 &amp; CSS3</p><p>? The school that you come from</p><p><br></p><p>What Does Not Matter (Unless Exceptionally Great)</p><p>? Your scores and grades in school</p><p>? Your Codeforces/Leetcode rating</p><p><br></p><p>Personality Expectations:</p><p>We believe that it takes a certain type of personality to do a certain kind of role</p><p>well. For this role, we expect that you are someone who is passionate about</p><p>making things work, and making them look good. You know how to maintain</p><p>balance between perfectionism and pragmatism. You plan your work, and do</p><p>not leave things for the last minute (unlike most engineers). You are creative and</p><p>research oriented, and love to explore ways to find things that you do not</p><p>already know.</p><p>On the other side, there is only one thing that we care for apart from</p><p>performance - your values. We have room for mistakes on the performance side;</p><p>we have no room for mistakes on your values.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 90000,
      "pgStipend": 90000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 180000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}