{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4842,
      "stationName": "UBER - Software Engineer, Hyderabad/Bengaluru",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1993,
      "projectId": 3158,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Work in all phases of Software development and to writing understandable, maintainable, and reusable software",
      "description": "<p>As an Uber Intern, you'll have a direct impact on the customer experience for both riders and</p><p>drivers. Do you like our service and want to bring them to the next level? Do you have a beef with</p><p>our app and want to fix it? Then you should apply to join our team. We are ambitious, engaged</p><p>and excited about disrupting the transportation industry across the world. Not just another</p><p>social web app: we are moving real assets and real people around their cities. Outside of your</p><p>work, you will build meaningful relationships with other Interns and Uber mentors through a</p><p>variety of summer activities.</p><p>If you meet these criteria, we welcome you to apply.</p><p><br></p><p><strong><u>Qualifications and Desired Skills</u></strong></p><ul><li>Demonstrated software engineering experience through previous internships, work</li><li>experience, coding competitions, and/or publications</li><li>? Programming experience one or more application or systems languages (Go, Python,</li><li>Ruby, Java, C/C++, etc)</li><li>? Interest in building tools/infrastructure</li><li>? A desire to be part of a team that delivers impactful results every day</li><li>? A commitment to writing understandable, maintainable, and reusable software</li><li>? An innate desire to deliver and a strong sense of accountability for your work</li><li>? Willingness to learn new languages and methodologies</li></ul><p><br></p><p>About Uber:</p><p>We’re changing the way people think about transportation. Not that long ago we were just an</p><p>app to request premium black cars in a few metropolitan areas. Now we’re a part of the</p><p>logistical fabric of more than 600 cities around the world. Whether it’s a ride or a sandwich, we</p><p>use technology to give people what they want, when they want it.</p><p>For the people who drive with Uber, our app represents a flexible new way to earn money. For</p><p>cities, we help strengthen local economies, improve access to transportation, and make streets</p><p>safer.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 177000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 177000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "akshaya.ganesan@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}