{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4773,
      "stationName": "Morgan Stanley - FID Research,Mumbai",
      "stationCity": "Mum",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2451,
      "projectId": 3715,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Fixed Income Research",
      "description": "<p>Description: Work with fixed income research strategists globally to develop and maintain data analysis infrastructures. Acquire, clean, maintain, and analyze data sets to identify trends and patterns. Develop quantitative models using econometrics and machine learning algorithms. Build web applications to monitor market movements and develop interactive tools to make quantitative models user friendly. Respond to bespoke data analysis requests from clients and internal stake holders. Automate delivery of reports and data-packs to clients.</p><p>Skill sets:</p><p>•</p><p>Master's degree or higher in a quantitative field such as Financial Mathematics, Statistics, Data Science, Engineering, Physics, or Economics.</p><p>•</p><p>Experience with statistical model development, modeling best practices and methodologies in the areas of data processing, sampling, model design/specification.</p><p>•</p><p>Hands on experience in any programing language (Python, C++, Q, Perl, JavaScript)</p><p>Traits expectation:</p><p>•</p><p>Excellent verbal, written, and interpersonal communication skills</p><p>•</p><p>Genuine interest and understanding of financial markets.</p><p>•</p><p>Candidates should be analytical, insightful, quick learners, team players, multi-taskers, with a positive attitude</p><p>Expected learning:</p><p>Specific courses required for project execution: MS degree for regulatory requirement, that's where the 5-year course is preferred. All applicants must know how to code in Python or R. At least one candidate should come from a comp science background</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 125000,
      "pgStipend": 125000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 250000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ambatipudi.v@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}