{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4844,
      "stationName": "UBER - Data Analytics,Hyderabad.",
      "stationCity": "Hyd",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1994,
      "projectId": 3159,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Data-driven and analytical ",
      "description": "<p>What you'll need</p><p>* Passionate about making magic for our communities and have an enthusiastic attitude. You view every support interaction as a chance to impact our riders and driver partners in a positive way</p><p>* You will be a powerful advocate for Uber’s customer excellence values and are obsessed with the community experience.</p><p>* An ace problem solver. Express creative problem solving skills, structured thinking &amp; be highly process oriented.</p><p>* You embrace challenges, and would stop at nothing to improve processes effectiveness -whether they are short-term workarounds, or more long-term process improvements.</p><p>* Data-driven and analytical in mindset. You can look at any spreadsheet and know the right questions to ask to get to actionable outcomes, and you know how to explain data in a compelling way.</p><p>* Get stuff done. You have superior organizational skills, integrity, and great follow-through on tasks.</p><p>What you will be doing:</p><p>* Build, maintain, and continue to optimize weekly, monthly and quarterly reporting of various teams we collaborate with across transport and Eats.</p><p>* Continually improve and automate our methods for gathering data and incorporating it into real-time models, analysis, and actions. Automate various business processes to improve efficiency at work.</p><p>* Review data models and queries while performing weekly and ad hoc data analysis to keep the nerve center of our operations engine running at full speed.</p><p>* Effectively communicate insights from and be able to tell a story around data, using various visualization tools available</p><p>* Build, run and maintain basic machine learning models around driver clustering, rider churn, social media sentiment analysis.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 60000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "akshaya.ganesan@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}