{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4856,
      "stationName": "VINJEY Software Systems Pvt. Ltd.,Bengaluru",
      "stationCity": null,
      "businessDomain": "Electronics",
      "problemBankId": 1254,
      "projectId": 2223,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Development/Optimization of Audio Codecs",
      "description": "<p>2.</p><p>Subjects: Engineering subjects that are used in the project are Computer Architecture, Computer Arithmetic, C/Assembly Language Programming, Audio/Digital Signal Processing and Audio Coding and Should have written programs that are more than 1000 LOC (Lines of code) and strong in Engineering Mathematics (MUST and a prerequisite) .</p><p>3.</p><p>Topics, Learning Outcomes and Problem Sets: Topics, learning outcomes and problem sets in relation to the Subjects will be provided.</p><p>4.</p><p>Literature Survey Phase: Activities performed in this phase are</p><p>4.1</p><p>Perform literature survey on the topics provided by reviewing materials available from the Company and other sources.</p><p>4.2</p><p>Synthesis of ideas and organization of them in a logical and coherent fashion in form of crisp notes on the subject (Deliverable: Notes.pdf)</p><p>4.3</p><p>Solve the identified quiz, problem sets and lab projects to establish clarity on the topics provided in the subject (Deliverable: Solutions.zip/pdf)</p><p>4.4</p><p>In terms of computer architectures, one of them will be RISC-V with other being one of the following – ARM Cortex M Series, ARM Cortex A Series (32 bit), ARM Cortex A Series (64 bit), Renesas RX, TI C6000 DSP and x86-64.</p><p>5.</p><p>Performance Library Phase: Development of performance optimized libraries with features and performance that match or beat the performance of silicon vendor supplied libraries to</p><p>5.1</p><p>Close the knowledge and skills gaps involved in optimization of standard performance kernels for the architecture chosen (Package.zip)</p><p>5.2</p><p>Understand the tradeoffs involved in performance engineering through software (Notes.pdf)</p><p>6.</p><p>Porting and Optimization of audio codec: Porting and Optimization of various encoder/decoder implementation based on open/industry standards in relation with audio coding. Steps involved are</p><p>6.1</p><p>Understanding of various algorithms used in standards, identification of mathematical/functional equivalent approaches.</p><p>6.2</p><p>Implementation that is performant with best possible tradeoffs made based on underlying hardware architecture.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 35000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "satya.yedlapalli@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}