{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5808,
      "stationName": "Centre for Effective Governance of India States (CEGIS) - New Delhi",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1287,
      "projectId": 2258,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Analytical tool to test accuracy of government data,   Title: Dynamic tools for sampling, budgeting, planning various data collection activities of govt",
      "description": "<p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Title: </strong><span style=\"color: rgb(0, 0, 0);\">Analytical tool to test accuracy of government data</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Description: </strong><span style=\"color: rgb(0, 0, 0);\">The project will involve improving an internal tool to analyse data from projects that aim to improve administrative data quality on the field. You'll be expected to conduct relevant literature review, manage and analyse administrative data from relevant government line departments, and implement required approaches and algorithms as modules in the above tool. You are expected to conduct robust checks on this open-source tool to ensure it works for all users, prepare documentation, implement feedback and bug fixes throughout. You'll also get to work closely with practitioners and government stakeholders to tailor research design and protocols to local context, and translate technical requirements to on-ground implementation. In addition, you'll support development of high-quality outputs (presentations, reports, briefs) summarizing project progress, data analyses, research findings for both technical and non-technical audiences and for dissemination at various forums.&nbsp;</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Skill sets: </strong><span style=\"color: rgb(0, 0, 0);\">Knowledge of statistics and econometrics; Python and full-stack open-source web development experience is preferred; Excellent spoken and written communication skills</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Expected learning: </strong><span style=\"color: rgb(0, 0, 0);\">In-depth governance issues within state governments and exposure to the realities of implementation of governance reform ideas; Understand advanced statistical concepts and represent them in easy-to-use web interface; Experience of working in a non-profit with diverse and highly experienced professionals, and understand pathways to have a future career in this domain</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Specific courses required for project execution: </strong><span style=\"color: rgb(0, 0, 0);\">Probability and Statistics, Computer Programming, Data Structures and Algorithms, Principles of Economics, Microeconomics, Econometrics (all), Mathematical &amp; Statistical Methods, Behavioural Economics, Object Oriented Programming</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Title: </strong><span style=\"color: rgb(0, 0, 0);\">Dynamic tools for sampling, budgeting, planning various data collection activities of govt</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Description:</strong><span style=\"color: rgb(0, 0, 0);\"> This project will involve developing an open-source portal that can used by any internal or government user as a plug-and-play tool to design and estimate the budget for common data collection activities like large-scale household survey, phone survey, survey of government facilities, etc. You'll be expected to conduct relevant literature review, manage and analyze sample data from relevant government line departments, implement required approaches and algorithms as modules in the above tool, automate reports and data visualisations suitable for department audiences at various levels, and go to the field as required. You are expected to conduct robust checks on these portals to ensure it works for all users, prepare documentation, implement feedback and bug fixes throughout. You'll get to work closely with practitioners and government stakeholders to tailor research design and protocols to local context, and translate technical requirements to on-ground implementation. Throughout, you'll support development of high-quality outputs (presentations, reports, briefs) summarizing project progress, data analyses, research findings for both technical and non-technical audiences and for dissemination at various forums.&nbsp;</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Skill sets: </strong><span style=\"color: rgb(0, 0, 0);\">Knowledge of statistics and econometrics; Python and full-stack open-source web development experience is preferred; Excellent spoken and written communication skills; Familiarity with public datasets and internationally and nationally recognized surveys (DHS, NFHS, NSS rounds, etc.) is a plus.</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Expected learning: </strong><span style=\"color: rgb(0, 0, 0);\">In-depth governance issues within state governments and exposure to the realities of implementation of governance reform ideas; Understand data systems of the government and how to design new surveys to provide insights to government audience at various levels in easy-to-use web interfaces; Experience of working in a non-profit with diverse and highly experienced professionals, and understand pathways to have a future career in this domain</span></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Specific courses required for project execution: </strong><span style=\"color: rgb(0, 0, 0);\">Probability and Statistics, Computer Programming, Data Structures and Algorithms, Object Oriented Programming, Principles of Economics, Microeconomics, Econometrics (all), Behavioral Economics, Mathematical &amp; Statistical Methods</span></p><p class=\"ql-align-justify\"><br></p><p>1.&nbsp;Episode 1 - Dr. Vijay Pingale:&nbsp;<a href=\"https://www.youtube.com/watch?v=8Pfuzf-3Kig&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=8Pfuzf-3Kig&amp;ab_channel=CEGIS</a></p><p>2.&nbsp;Episode 2 - Parul Agarwal:&nbsp;<a href=\"https://www.youtube.com/watch?v=4TXTq1sL2sg&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=4TXTq1sL2sg&amp;ab_channel=CEGIS</a></p><p>3.&nbsp;Episode 3 - Devashish Deshpande:&nbsp;<a href=\"https://www.youtube.com/watch?v=o2HJ5_kb3yM&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=o2HJ5_kb3yM&amp;ab_channel=CEGIS</a></p><p>4.&nbsp;Episode 4 - Ziaul Hoda:&nbsp;<a href=\"https://www.youtube.com/watch?v=vNV5E4tUzHQ&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=vNV5E4tUzHQ&amp;ab_channel=CEGIS</a></p><p>5.&nbsp;Episode 5 - Praveen Ravi:&nbsp;<a href=\"https://www.youtube.com/watch?v=lUxrSs8scN4&amp;t=35s&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=lUxrSs8scN4&amp;t=35s&amp;ab_channel=CEGIS</a></p><p class=\"ql-align-justify\">6. Episode 6 - Reflections:&nbsp;<a href=\"https://www.youtube.com/watch?v=ConPl8d1HWo&amp;ab_channel=CEGIS\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.youtube.com/watch?v=ConPl8d1HWo&amp;ab_channel=CEGIS</a></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 25000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 25000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ramesh.venkatraman@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}