{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5717,
      "stationName": "Timble Technologies",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1150,
      "projectId": 2032,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Market Analytics Project for Financial Empowerment and Verification Services",
      "description": "<p>Description:</p><p>This project involves conducting comprehensive market research and analysis to identify</p><p>potential clients and understand the competitive landscape for Timble Glance's KYC</p><p>Verification services. The focus will be on leveraging knowledge of financial</p><p>empowerment, technology products, and services to find new clients and assess market</p><p>competition. The project will also encompass analyzing quantification rules, relational</p><p>statements to enhance decision-making processes.</p><p>Skill Sets:</p><p>Market Research and Analysis:</p><p>? Proficiency in market research techniques.</p><p>? Ability to identify potential clients and market opportunities.</p><p>? Competence in competitive analysis.</p><p>Financial Analysis and Risk Management:</p><p>? Understanding of types of business risk and derivatives.</p><p>? Knowledge of hedging with derivatives and derivative products.</p><p>? Familiarity with pricing and cost of carry in futures and forwards.</p><p>Quantitative Analysis:</p><p>? Expertise in symbolizing statements involving relations.</p><p>? Application of quantification rules to prove arguments.</p><p>? Ability to prove the invalidity of statements involving quantifiers.</p><p>Technology and Biomedical Signal Processing:</p><p>? Basic knowledge of medical instruments for biomedical signal recording.</p><p>? Skills in noise removal and feature extraction from biomedical signals.</p><p>? Understanding of the clinical relevance and patient safety in biomedical</p><p>contexts.</p><p>Optical Fiber Technology:</p><p>? Knowledge of optical fibers, image transmission, and fiber optic systems.</p><p>? Familiarity with fiber production, testing, and characterization.</p><p>Traits Expectation:</p><p>Analytical Thinking: Ability to dissect complex problems and data sets to derive</p><p>actionable insights.</p><p>Detail-Oriented: Precision in research, data analysis, and reporting.</p><p>Innovative: Creative in finding new market opportunities and solutions.</p><p>Tech-Savvy: Proficient in utilizing technology for market analytics and financial analysis.</p><p>Communication: Strong verbal and written communication skills to present findings</p><p>clearly.</p><p>Expected Learning:</p><p>Market Dynamics: Understanding the dynamics of the market for verification services,</p><p>including client needs and competitive forces.</p><p>Quantitative Reasoning: Mastery in the use of quantification rules and relational</p><p>statements to validate and invalidate arguments.</p><p><br></p><p>Financial Instruments: Deep knowledge of derivatives, their features, participants, and</p><p>functions in the market.</p><p>Biomedical Signal Processing: Insights into the fundamentals of biomedical signal</p><p>processing and its relevance in clinical settings.</p><p>Optical Fiber Applications: Understanding the applications and technology behind</p><p>optical fibers and optoelectronic devices.</p><p>This project aims to provide a holistic approach to market analytics by integrating</p><p>financial, technological, and analytical expertise to empower individuals and businesses</p><p>through high-quality technology products and services.</p><p>Specific Courses Required for Project Execution:</p><p>? HSS F236 Symbolic Logic</p><p>? FIN F311 Derivatives of Risk Management</p><p>? INSTR F426 Fibre Optics &amp; Optoelect</p><p>? INSTR F432 Medical instrumentation</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 25000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 25000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}