{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5017,
      "stationName": "Wayfair Global Technology Pvt. Ltd- Search and Recommendations",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2189,
      "projectId": 3404,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title:Software Intern (Search and Recommendations Platform and Services) 2) Title: Software Intern (Search and Recommendations Data Engineering)",
      "description": "<p>Title:Software Intern (Search and Recommendations Platform and Services)</p><p>Description: Intern will focus on building/enhancing features to tools and frameworks</p><p>which improve the velocity of enabling better Search and Recommendations</p><p>experiences on Wayfair website, mobile app and email channels</p><p>Skill sets: Computer Science, Programming in any popular language (Java/python</p><p>preferred), Git, Linux/Unix based operating system, SQL</p><p>Expected learning: Interns will get hands-on experience in working on real world</p><p>projects which incorporate Machine Learning models and solve problems for</p><p>engineers, data scientists and analytics that apply these models in S&amp;R space. They</p><p>Title: Software Intern (Search and Recommendations Data Engineering)</p><p>Description: Build and maintain robust data pipelines that are used by data</p><p>science and analytics teams in the search and recommendations organization,</p><p>enabling the teams to build, experiment and iterate business and</p><p>recommendation logic at speed, scale and quality</p><p>Skill sets: Computer science, Big Data systems- Spark/Scala, MPP- BigQuery,</p><p>SQL, programming in popular language (python preferred),Git, Linux/Unix based</p><p>operating system.</p><p>Expected learning: Interns will have hands-on experience by working on real</p><p>world problems to build production systems at PB scale using GCP services and</p><p>other software tools (for CI/CD and Infra) that cater to millions of wayfairs</p><p>customers. They will learn on how the S&amp;R space works within an</p><p>e-commerce industry at depth and all about software development lifecycle</p><p>using agile methodology.</p><p>Specific courses required for project execution: Computer Science</p><p>Fundamentals, Big Data, Object Oriented Design, Databases.</p><p>will also understand the concepts behind building/maintaining systems which scale to</p><p>millions of requests per minute</p><p>Specific courses required for project execution: Computer Science Fundamentals,</p><p>Object Oriented Design, Operating Systems, Databases</p><p>Some Machine Learning course (not required)</p><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "pradheep.kumar@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}