{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6406,
      "stationName": "Harman DTS",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2310,
      "projectId": 3549,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "HARMAN DTS Global Internship Program",
      "description": "<p>HARMAN DTS Global Internship Program</p><p>Interns at HARMAN can make an impact with real work and network with brilliant</p><p>professionals during their time with us. The Harman DTS Specialized Program</p><p>Internship program https://jobs.harman.com/students make sure our interns receive a</p><p>well-rounded experience in advanced technology and business areas. The interns we</p><p>recruit bring with them personal attributes such as learnability, leadership capability,</p><p>client focus, analytical, critical thinking skills, and the ability to communicate your</p><p>ideas to technical and non-technical audience. Your responsibilities would include</p><p>building solutions and frameworks in emerging technology and business areas. Ideate</p><p>&amp; create IP, build demonstrable innovative &amp; path breaking PoC, prototypes, products,</p><p>platforms, accelerators. You will be mentored by Global Product, Technology and</p><p>Business Leaders and will drive the development and design of new platforms and</p><p>capabilities in areas such as Mobility, Advanced Analytics, AI/ML, Quantum Computing,</p><p>Cybersecurity, Big Data, Cloud Computing, Internet of Things, 5G, No-code</p><p>Low-code development, Platform businesses, New Business Models, Vertical Specific</p><p>Solutions, Open Innovation, Innovation Crowdsourcing and IP licensing.</p><p><br></p><p>Project Descriptions of Technology Internships</p><p><br></p><p>© 2022 HARMAN International | services.harman.com</p><p>Video Patient Monitoring and anomaly detection</p><p>Enhancing patient safety while optimizing resources is a continued area of focus</p><p>for the global health care environment. Sitters, or one-to-one observers, are</p><p>commonly used in inpatient settings to meet monitoring needs of high-risk</p><p>patients. Utilizing AI/ML based video analytics technology such as continuous</p><p>video monitoring can relieve sitters to allow for optimal productivity, increased</p><p>safety, cost reduction, and nurse/family satisfaction. The project involves building</p><p>AI/ML driven video analytics module to monitor patients as well as surveillance</p><p>of people in contact with the patient as well as the surrounding facilities. Once</p><p>an anomaly id identified, the system should push them to the nursing staff.</p><p><br></p><p>Intelligent Document Processing</p><p>Globally about 80-90% of all data is unstructured. Insurance companies have a</p><p>large and rapidly growing unstructured data content and many of them do not</p><p>having the ability to make use of it to take the right business decisions.</p><p>Unstructured content includes Policy Documents, Claims Documents, Annual</p><p>Reports, Emails, Broker Submissions, Knowledge Repositories, paper documents</p><p>etc. The Intelligent Document Processing engine executes document</p><p>pre-processing using image analytics and readies the document for information</p><p>extraction. The extracted data is them analysed using NLP techniques and</p><p>corrected for errors, thereby ensuring an extremely high degree of data</p><p>extraction accuracy. The engine checks for inter-field validity and flags values that</p><p>occur with low confidence to call for manual intervention.</p><p>Hospital Readmission Prediction</p><p>A hospital readmission is when a patient who is discharged from the hospital,</p><p>gets re-admitted again within a certain period such as 30 days, after the</p><p>discharge. Hospital readmission prediction involves learning from historical</p><p>medical data to predict probability of a patient returning to hospital in a certain</p><p>period after the discharge. The objective is to help health providers improve</p><p>quality of care, deliver better treatment, lower hospital readmission rate, and</p><p>reduce the medical costs. This project aims to achieve Interpretable &amp;</p><p>Explainable Machine Learning results for the following questions:</p><p>How accurately can we predict hospital readmission?</p><p>What factors are the strongest predictors of hospital readmissions in a certain</p><p>disease category?</p><p><br></p><p>© 2022 HARMAN International | services.harman.com</p><p><br></p><p>Claims Analytics</p><p>Insurers rely on rule-based engines which raise alerts for Claims fraud in casualty</p><p>insurance. A large team triages these alerts and select the candidate claims for</p><p>further investigation. There is also the problem of False positives, where only a</p><p>small percentage of the of the validated claims turn out to be actual fraudulent</p><p>claims. Businesses can automate the triaging process with AI model validating</p><p>Fraudulent claim alerts using multivariate data. Create features from the</p><p>multivariate data along with the associated claims description (free text). Robust</p><p>machine learning algorithms to create models with &lt;0.2% false negatives and</p><p>none of the actual fraudulent claims being missed. Reduce the number of alerts</p><p>to be reviewed by the triage team by 90%. Incorporate model explainability.</p><p><br></p><p>Smart Medical Devices Management</p><p>Predictive Intelligence to monitor and predict the health of devices, based on</p><p>usage and log data. The objective is to help the monitoring and maintenance</p><p>team to get device intelligence data on a regular basis and predict and visualize</p><p>the data so they can take preventive actions. Key features of the solution include</p><p>Device Monitoring, Device Health Prediction, Workflow Management,</p><p>Omni-channel support through cloud based always on dashboard. The intern</p><p>will work on key features of the solution and build descriptive and predictive</p><p>AI/ML models.</p><p><br></p><p>Cybersecurity Asset Management</p><p>HARMAN Cybersecurity Asset Management Platform helps enterprises keep</p><p>their IT systems safe and secure using real-time threat intelligence analytics. The</p><p>patent pending Cybersecurity Asset Management Platform analyses enterprise</p><p>systems at the hardware, operating system, and application levels to discover</p><p>security vulnerabilities, conduct risk scoring, classification, and automated</p><p>remediation of vulnerabilities. This results in effective vulnerability scans, accurate</p><p>discovery of vulnerabilities, enhanced compliance to security policies, reduced</p><p>vulnerability patch response times, faster deviations discovery, reduced false</p><p>positives through risk scoring powered by the cybersecurity intelligence engine,</p><p>effective compliance analysis and reduced costs through automated remediation.</p><p>This project involves working on key AI/ML modules of the platform including</p><p>risk scoring, anomaly detection, NLP of vulnerability descriptions and automation</p><p>of remediation.</p><p><br></p><p>Project Descriptions of Business Internships</p><p><br></p><p>HARMAN Remote Care Platform</p><p>HARMAN Remote Care Platform is a connected care solution that gathers data</p><p>to derive insights, can improve care delivery efficiency, increase patient</p><p>engagement, and influence outcomes in a big way, outside of traditional clinical</p><p>settings. Our solution can form the backbone of your virtual care strategy with</p><p>patient data collection, contextualization, patient-provider communication,</p><p>medication adherence, and more in the form of a highly secure, robust, and</p><p>scalable platform. Project objective is to Identify Complementarities for the</p><p>Platform, identify new use cases, reexamine the current pricing strategy, and</p><p>identify new Growth levers for the Platform.</p><p><br></p><p>HARMAN Mediasuite</p><p>HARMAN Media Suite is an enterprise video content management platform to</p><p>enable immersive webcasts and recorded video assets. It can provide</p><p>organizations with streaming scalability. With a complete solution for Enterprise</p><p>CDN (content delivery network) delivery, organizations can seamlessly optimize</p><p>video sharing on their network or choose to leverage best-of-breed third-party</p><p>content delivery solutions. The distributed architecture of Media Suite allows up</p><p>to 50,000 web viewers to access it at the same time and supports recording for</p><p>up to one hundred concurrent video sessions and streaming of up to fifty live</p><p>events. Media Suite also offers tight integration with video conferencing solutions,</p><p>allowing users to playback video-on-demand content into a multiparty meeting</p><p>or conference room. Project objective is to Identify Complementarities for the</p><p>Platform, identify new use cases, reexamine the current pricing strategy, and</p><p>identify new Growth levers for the Platform.</p><p><br></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 40000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 40000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "shreyas.rao@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}