{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6202,
      "stationName": "Silverleaf Capital Services Private Limited",
      "stationCity": "Mum",
      "businessDomain": "Others",
      "problemBankId": 1841,
      "projectId": 2950,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Project Pulse",
      "description": "<p>Title: Project Pulse</p><p>Description: In this role, student will join our fast-paced, high-performance trading environment, contributing to the development and refinement of trading infrastructure and cloud data pipeline. Student will tackle large, complex data, discovering how to extract valuable insights and apply them to improve trading performance.</p><p>Skill sets:</p><p>A strong background in data structures and algorithms</p><p>Brilliant problem solving abilities</p><p>Experience with at least one Object-</p><p>Oriented Programming language (preferably C+D)</p><p>Ability to write good efficient, modular and unit-tested - code</p><p>Working knowledge of Linux</p><p>Knowledge of Functional Programming and/or Systems Programming is a plus</p><p>Experience with Machine Learning and Statistics is a plus</p><p>Traits expectation: Punctuality, Attention to details, Self-motivated and Ability to think out of the box.</p><p>Expected learning: Student will gain valuable experience in establishing and optimizing real-time exchange connectivity, essential for efficient high-frequency trading. Working with vast and complex data, student will develop skills in data analysis to extract meaningful insights that directly impact trading strategies. Working closely with a team of traders and engineers, understanding how robust infrastructure supports and enhances the performance of high-speed trading systems.</p><p>Specific courses required for project execution: B.E. Computer Science.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 100000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 100000,
      "createdBy": "admin@pilani.bits-pilani.ac.in",
      "assignedFacultyEmailId": "atuls@goa.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}