{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5409,
      "stationName": "BureauID India Private Limited",
      "stationCity": "Bng",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1183,
      "projectId": 2111,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Backend Engineering In the Identity Verification Domain",
      "description": "<p>Title: Backend Engineering In the Identity Verification Domain</p><p><br></p><p>Description: Developing inhouse API solutions for fraud prevention, risk mitigation and</p><p>Risk Orchestration</p><p>Skill sets: Coding - Currently pursuing a Bachelor's or Master's degree in Computer</p><p>Science, Software Engineering, or a related field.</p><p>Basic programming skills in one or more programming languages (e.g., Python, Java,</p><p>JavaScript, C++, etc.).</p><p>Familiarity with software development concepts, tools, and methodologies.</p><p>Traits expectation: Strong passion for software development and technology.</p><p>Excellent problem-solving and analytical skills.</p><p>Strong communication and teamwork skills.</p><p>Eagerness to learn and adapt in a fast-paced and collaborative environment.</p><p>Expected learning:</p><p>Software Development: Collaborate with our engineering team on software development</p><p>projects, including coding, testing, and debugging.</p><p>Feature Enhancement: Assist in adding new features and functionalities to our SaaS</p><p>applications, ensuring they meet quality standards and user requirements.</p><p>Bug Fixes: Identify and resolve software defects and issues to maintain the reliability and</p><p>performance of our products.</p><p>Documentation: Create and update technical documentation for software components,</p><p>APIs, and procedures.</p><p>Code Review: Participate in code reviews to learn best practices and contribute to the</p><p>team's code quality.</p><p>Testing: Conduct unit testing and assist in the development of test cases to ensure</p><p>software reliability.</p><p>Collaboration: Work closely with cross-functional teams, including product management</p><p>and design, to understand project requirements and deliver high-quality solutions.</p><p>Learning and Growth: Proactively seek opportunities for skill development and learning</p><p>from experienced engineers within the company.</p><p>Specific courses required for project execution: DSA, OOP, Computer Programming</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 35000,
      "createdBy": "f20201083@pilani.bits-pilani.ac.in",
      "assignedFacultyEmailId": "reddy.rani@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}