{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4669,
      "stationName": "Google India Hardware Engineering",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1935,
      "projectId": 3059,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Intern - Technical",
      "description": "<p>Google is and always will be an engineering company. We hire people with a broad set of</p><p>technical skills who are ready for some of technology's greatest challenges and make an</p><p>impact on millions, if not billions, of users. At Google, engineers not only revolutionize search,</p><p>they routinely work on massive scalability and storage solutions, large-scale applications and</p><p>entirely new platforms for developers around the world. From Chrome, Android to YouTube,</p><p>Social to Local, Google engineers are changing the world one technological achievement after</p><p>another.Additional Role Description:</p><p>Our Winter internships will start in January 2025 and will be 22-24 weeks in duration.</p><p>As a Hardware Engineering intern, you will design, develop and deploy next generation</p><p>consumer hardware. Google's Consumer Hardware Silicon division (gChips) builds chips (SoCs</p><p>and ASICs) optimized for Google-branded consumer devices. We aim to build a team with</p><p>great talent resonating Google's culture of innovation and fun and you have an opportunity to</p><p>be part of it.</p><p>As a member of a fast-paced multi-disciplinary team, you will use your creativity and diverse</p><p>range of engineering experience to explore solutions to a variety of engineering problems.</p><p>Additionally, as an Electrical Engineer, you will participate in the design, analysis, and</p><p>prototyping of new concepts.Responsibilities:</p><p>? Work with the team to develop power and performance optimized chips</p><p>? Contribute to the design, verification and silicon implementation of chips</p><p>? Collaborate with local and remote teams in automating design flows.</p><p>? Minimum qualifications:</p><p>? Currently enrolled in an Associate, Bachelors, or Masters degree program and or post</p><p>? secondary or training experience with a focus on subjects in Electrical Engineering or a</p><p>? related field.</p><p>? Relevant Internship work, work experience, or personal project experience in Hardware</p><p>? or Electrical Engineering.</p><p>? Basic design concepts and computer hardware architecture? Experience in one or more of the following areas: SoC/ASIC Design, Design Verification,</p><p>? Physical Design, Design for Testability.</p><p>? Experience with Verilog/HDL or System Verilog coding.</p><p>? Experience with one of the scripting languages - PERL, TCL or Python</p><p>? Experience with EDA tools and methodology like Lint, CDC, Synthesis, Formal</p><p>? Equivalence or low Power reduction techniques</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 125000,
      "pgStipend": 134000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 259000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}