{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5921,
      "stationName": "Cormorant Engineering India Private Limited - Development",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1433,
      "projectId": 2472,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Full Stack Developer",
      "description": "<p>Description:</p><p>Responsible for technical design and development of solutions according to the defined requirements</p><p>Making sure your work is readable and maintainable. Ability to refactor is a must.</p><p>Estimate technical effort, work breakdown structure, risks, and solutions at a solution level.</p><p>Develop new functionality on our existing software products.</p><p>Ability to maintain effective and consistent communication within the team, with peers and stakeholders across own and other teams.</p><p>Provide input to application development/engineering methodologies, standards and leading practices.</p><p>Anticipate problems before they occur, define the problem, identify possible causes, work with a team to find solutions, select and implement the most appropriate solution. Ability to clearly articulate both problems and proposed solutions.</p><p>Proactive approach to identifying issues and presenting solutions and options, and where appropriate, leading to resolution.</p><p>Participate in Requirement gathering sessions with clients, interact with the client's technical teams</p><p>Skill sets:</p><p>Full Stack Web Developer (.Net Core + Angular).</p><p>At least a year of relevant experience</p><p>C#, .Net Core, MVC, Web API, EF Core, Typescript, Angular, Angular Material</p><p>SQL Commands, Stored Procedures, DB performance tuning</p><p>Good to have skill: Powerbase, API/Flatfile integration, Middleware.</p><p>Working knowledge of Version Control Using GIT</p><p>Working KrPage dg 2 of Deve6 pment Metodologes like Agile</p><p>Traits expectation:</p><p>Must have passion for coding and ability to learn new technologies quickly</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 40000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 40000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": null,
      "studentProjectDetails": null
    }
  ]
}