{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5003,
      "stationName": "Mach33.aero,Bengaluru",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1302,
      "projectId": 2277,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Thesis Building and Innovation Curation",
      "description": "<p>Description: Social Alpha works in the domain of Climate and Sustainability where our teams constantly</p><p>identify new problem statements and build our impact thesis, which encapsulates our knowledge of the</p><p>sector and defines our strategy. In Climate and sustainability, our focus areas include Energy Transition,</p><p>Sustainable Mobility, Circularity and alternative materials, Urban Transition (Water and air pollution,</p><p>Sustainable Construction), Industrial Decarbonisation and Carbon Capture, utilization, and storage. The</p><p>interns will work with the sectoral teams in helping refine our impact thesis, evaluate new start-ups for</p><p>a thesis and mandate fit with Social Alpha, assist the team in the investment process and participate in</p><p>venture-building activities for our investment portfolio.</p><p>Skill sets: Technology evaluation, financial modelling, building business models, market research and</p><p>estimation, strategy</p><p>Expected learning: Insights into emerging deep science technologies spanning multiple sectors,</p><p>venture development, equity investments and portfolio management</p><p>Specific courses required for project execution: Courses related to Business Analysis &amp;</p><p>Valuation, New Venture Creation, Entrepreneurship</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "amar.s@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 5003,
      "stationName": "Mach33.aero,Bengaluru",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1302,
      "projectId": 2278,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Data Analyst Intern – Governance, Insights and Analytics Team",
      "description": "<p>Description: The team is responsible for ensuring the efficient management, analysis, and</p><p>interpretation of data critical to our organization's success. This role will play a pivotal part in managing</p><p>our deal pipeline and program management platform, driving insights, enhancing data systems, and</p><p>monitoring key performance indicators (KPIs) and objectives. The intern will assist the team in</p><p>developing and maintaining a database and generating insights from the data.</p><p>Skill sets: Experience in data analysis and database management (Airtable experience is preferred or</p><p>other relevant RDBMS), Data Visualisation tools like Power BI.</p><p>Expected learning: The students will learn the creation and management of RDBMS, data visualization</p><p>(Tableau/Power BI), process improvement and automation, and soft skills.</p><p>Specific courses required for project execution: Database Management Systems, Data</p><p>Visualisation, Data Science</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "amar.s@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}