{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6031,
      "stationName": "Hyperlab Sportech Private Limited",
      "stationCity": "Gan",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1641,
      "projectId": 2723,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Strategic Support and Market Analysis",
      "description": "<p>Description: Assist the founders in developing and executing the company’s strategic plan. Conduct</p><p>market research and competitive analysis to inform strategic decisions. Prepare presentations, reports,</p><p>and other materials for internal and external stakeholders. Proactively identify strategic opportunities</p><p>and manage self-driven projects with minimal supervision. Facilitate communication and coordination</p><p>across teams to ensure alignment with strategic objectives.</p><p><br></p><p>Skill sets: Market research, strategic planning, report writing, presentation skills, proactive and self-</p><p>managerial</p><p><br></p><p>Expected learning: Develop strategic thinking and market analysis skills, gain experience in preparing</p><p>strategic documents and presentations, learn to navigate and contribute to a startup environment,</p><p>experience firsthand how a startup operates, including the challenges and opportunities.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "mssoni@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    },
    {
      "stationId": 6031,
      "stationName": "Hyperlab Sportech Private Limited",
      "stationCity": "Gan",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1641,
      "projectId": 2726,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project Management and Operational Excellence",
      "description": "<p>Description: Oversee the planning, execution, and completion of key projects. Coordinate cross-</p><p>functional teams to ensure alignment and timely delivery of project milestones. Identify and implement</p><p><br></p><p>process improvements to enhance operational efficiency. Proactively manage and drive projects,</p><p>ensuring minimal supervision is needed. Facilitate effective communication and coordination among</p><p>team members and external stakeholders to ensure smooth project execution.</p><p>Skill sets: Project management, process improvement, team coordination, operational management,</p><p>proactive and self-managerial</p><p>Expected learning: Gain hands-on experience in project management and operational efficiency,</p><p>develop skills in team coordination and process improvement, learn the intricacies of startup operations,</p><p>and understand the dynamic nature of startup environments</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 30000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "mssoni@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}