{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6301,
      "stationName": "AMAZON SDE - ES",
      "stationCity": null,
      "businessDomain": "Electronics",
      "problemBankId": 2066,
      "projectId": 3245,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Software Development Engineer Six Month Internship – 2025",
      "description": "<p>Software Development Engineer Six Month Internship – 2025 (in-person)</p><p>Introduction</p><p>At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers.</p><p>The intense focus we have on our customers is why we are one of the world’s most beloved brands</p><p>– customer obsession is part of our company DNA. Our interns write real software and collaborate</p><p>with a select group of experienced software development engineers (SDEs) who guide interns on</p><p>projects that matter to our customers. As an intern, you will be matched to a manager and a</p><p>mentor. You will have the opportunity to influence the evolution of Amazon technology and lead</p><p>mission critical projects early in your career. Your design, code, and raw smarts will contribute to</p><p>solving some of the most complex technical challenges in the areas of distributed systems, data</p><p>mining, automation, optimization, scalability, and security – just to name a few. In addition to</p><p>working on an impactful project, you will have the opportunity to engage with Amazonians for both</p><p>personal and professional development, expand your network, and participate in activities with</p><p>other interns throughout your internship. No matter the location of your internship, we give you</p><p>the tools to own your project and learn in a real-world setting. Many of our technologies overlap,</p><p>and you would be hard pressed to find a team that is not using Amazon Web Services (AWS),</p><p>touching the catalogue, or iterating services to better personalize for customers. If this opportunity</p><p>interests you, apply and come chart your own path at Amazon. We want you to be the best version</p><p>of yourself – to continuously evolve and improve</p><p>Job location</p><p>By applying to this position your application will be considered for all locations we hire for in India.</p><p>This includes but is not limited to Bengaluru, Chennai, Hyderabad, Delhi and Pune.</p><p>Amazon internships are full-time (40 hours/week) for six months between Jan and June 2025 (as</p><p>per university academic framework).</p><p>Key job responsibilities</p><p>• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring</p><p>innovative products and services to market.</p><p>• Design and build innovative technologies in a large distributed computing environment, and help</p><p>lead fundamental changes in the industry.</p><p>• Create solutions to run predictions on distributed systems with exposure to innovative</p><p>technologies at incredible scale and speed.</p><p>• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and</p><p>easy to manage/use.</p><p>• Ability to design and code the right solutions starting with broadly defined problems.</p><p>• Work in an agile environment to deliver high-quality software.</p><p>Basic qualifications</p><p><br></p><p>• Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer</p><p>Engineering, or related field at time of application – Graduation year 2025</p><p>• Familiarity with the syntax of languages such as Java, C/C++ or Python.</p><p>• Knowledge of Computer Science fundamentals such as object-oriented design, algorithm design,</p><p>data structures, problem solving, and complexity analysis.</p><p>Preferred qualifications</p><p>• Previous technical internship(s).</p><p>• Experience with distributed, multi-tiered systems, algorithms, and relational databases.</p><p>• Experience in optimization mathematics such as linear programming and nonlinear optimization.</p><p>• Effectively articulate technical challenges and solutions.</p><p>• Adept at handling ambiguous or undefined problems as well as ability to think abstractly.</p><p>Please note that Amazon internships require full-time commitment during the duration of the</p><p>internship. During the course of internship, interns should not have any conflicts including but not</p><p>limited to academic projects, classes or other internships/employment. Any exam related details</p><p>must be shared with the hiring manager to plan for absence during those days. Specific team norms</p><p>around working hours will be communicated by the hiring/ reporting manager at the time of</p><p>commencement of internship. Candidates receiving internship will be required to submit declaration</p><p>of their availability to complete the entire duration of internship duly signed by a competent</p><p>authority at their University. Internship offer will be subjected to successful submission of the</p><p>declaration</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 110000,
      "pgStipend": 110000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 220000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "tvrao@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}