{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6195,
      "stationName": "Tekuncorked allot Private Limited",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 1821,
      "projectId": 2930,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project 1 Software Modeling and Dashboarding for Analytics & Insights for Smart Grid Use-cases Description: Data Architecture, Modeling and Visualization  Project 2 Embedded Al for Smart Grid Use cases",
      "description": "<p>   Title: Software Modeling and Dashboarding for Analytics &amp; Insights for Smart <span style=\"background-color: rgb(255, 255, 255); font-size: 18px;\">Grid </span>Use<span style=\"font-size: 18px; background-color: rgb(255, 255, 255);\"> </span>-cases Description: Data Architecture, Modeling and Visualization</p><p>Skill sets: Data Modeling/Backend/Frontend/FuII-Stack Development Experience</p><p>Traits expectation: Strong Analytical and problem solving; Prior internship experience in a startup, relevant skill-set, development experience with Node is, Python, dotnet, strong communication skills, ability to handle ambiguity and work independently Expected learning: System Modeling, Webapp Development and Visualization</p><p>Specific courses required for project execution: Software Development, data Modeling.</p><p>   Title: Embedded Al for Smart Grid Use cases</p><p>Description: Learning models for forecasting</p><p>Skill sets: Proficiency in C, C++, Knowledge of devices, sensors, signal processing, understanding of machine learning and deep learning concepts</p><p>Traits expectation: Strong Analytical and problem solving; Prior internship experience in a startup, relevant skill-set, development experience with C/C++, Python, dotnet, strong communication skills, ability to handle ambiguity and work independently</p><p>\tExpected learning: ML and Al Library Generation and Integration, Al Real-life use cases. Specific courses required for project execution: ML. Al, Software Development.</p><p>  </p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 12000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 12000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "anjani.koka@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}