{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6221,
      "stationName": "IITM Pravartak Technologies Foundation",
      "stationCity": "Chn",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1894,
      "projectId": 3009,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: DB Engineering",
      "description": "<p class=\"ql-align-justify\"><br></p><p><strong style=\"color: rgb(0, 0, 0);\">Description:</strong></p><p><span style=\"color: rgb(0, 0, 0);\">IITM Pravartak Technologies Foundation is a Technology Innovation Hub (TIH) funded by the Department of Science and Technology, Government of India under the National Mission on Interdisciplinary Cyber-Physical Systems. The TIH is hosted by IIT Madras and specializes in Sensors, Networking, Actuators, and Control Systems (SNACS).&nbsp;</span></p><p><br></p><p><span style=\"color: rgb(0, 0, 0);\">The key objectives of Technology, Entrepreneurship, and Human Resources Development, IITM Pravartak is preparing young India for the next generation of world-class technologies. IITM Pravartak provides an eco-system that enables fundamental research to translate to products, integrating academics, industry, government and international organizations.</span></p><p><span style=\"color: rgb(0, 0, 0);\">&nbsp;</span></p><p><span style=\"color: rgb(0, 0, 0);\">One such initiative is to develop a secure database with High availability support covering the various features across operating systems which is deployable on-premises and cloud platforms. The aim of this database will be to make it available with Enterprise support and eligible/suitable for use across commercial and government enterprises.&nbsp;</span></p><p><span style=\"color: rgb(0, 0, 0);\">The DB is planned to be built from the forked version of PostgreSQL as the secured base version and fulcrum to retain compatibility with some of the existing tools and ease migration in a DBMS ecosystem.&nbsp;&nbsp;</span></p><p><br></p><p><span style=\"color: rgb(0, 0, 0);\">The database will be extended/enhanced by utilizing selective open-Source packages / products / tools. This will be in addition to come out with innovative features to improve the performance of the core database engine wherever possible. The vision is to enable creation of multiple streams of applications for the database (enterprise, mobile, in memory etc.).&nbsp;</span></p><p><br></p><p><strong style=\"color: rgb(0, 0, 0);\">Skill sets: </strong><span style=\"color: rgb(0, 0, 0);\">C, C++, Linux, OS internals, Networking, PostgreSQL/MySQL/Oracle/MSSQL, Python/Perl, Open-source development methodology, Data Structures, Algorithms</span></p><p><br></p><p class=\"ql-align-justify\"><strong style=\"color: rgb(0, 0, 0);\">Traits expectation: </strong><span style=\"color: rgb(0, 0, 0);\">Teamwork, Go-getter, analytical thinking, problem-solving, critical thinking, time management, willingness to learn, Previous successful completion of open-source projects (preferable)</span></p><p><br></p><p><strong style=\"color: rgb(0, 0, 0);\">Expected learning: </strong><span style=\"color: rgb(0, 0, 0);\">DB design principles, query optimization, performance tuning, debugging, system-level understanding, collaboration on large-scale projects, database security concepts, testing methodologies, software development lifecycle</span></p><p><br></p><p><strong style=\"color: rgb(0, 0, 0);\">Specific courses required for project execution: </strong><span style=\"color: rgb(0, 0, 0);\">C programming, Operating Systems, Data Structures / Advanced Data Structures, Linux programming, Database concepts (RDBMS), Python Programming</span></p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 45000,
      "pgStipend": 45000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 90000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "gvenki@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}