{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6360,
      "stationName": "Jupiter Brothers Data Science Pvt Ltd",
      "stationCity": "Chn",
      "businessDomain": "CSIS/IT",
      "problemBankId": 2225,
      "projectId": 3444,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Title: Internship Program forDeveloping an Educational Tech Platform to Build knowledge  base from Engineering Experiences",
      "description": "<p><br></p><p>Description: This internship offers an opportunity for students to work on an innovative</p><p>educational technology platform designed to capture and transfer the valuable experiences</p><p>of seasoned engineers to ku&gt;aming employees. The platform will be used todocument document real-world</p><p>engineering challenges and solutions, focusing on specific industry sectors like</p><p>hospitality design. Interns will work closely with experienced engineers and develop tools for</p><p>knowledge capture and contribute toa system that ensures seamless knowledge transfer</p><p>within the company. The goal is to prevent knowledge loss when engineers leave the</p><p>company, allowing new hires to leverage existing expertise and reduce their learning curve</p><p>1. Understanding of software development (web and mobile apps)</p><p>2. Knowledge ofdatabases and content management systems</p><p>3. Familiarity with cloud services for data storage and sharing</p><p>4. Technical writing skills to document processes and experiences</p><p>5. Experience or interest in educational technology or learning management systems</p><p>6. Strong communication and collaboration skills</p><p>7. Experience with Generative AI (GenAI) for automated content generation,</p><p>knowledge extraction, and interactive learning tools</p><p>Expected learning:</p><p>Interns will gain hands-on experience in:</p><p>1. Developing and managing an educational tech platform</p><p>2. Collaborating with engineers tocapture and document real-world project knowledge</p><p>3. Understanding the nuances of knowledge transfer in an engineering environment</p><p>4. Working with industry-specific project data, particularly in hospitality design</p><p>5. Learning best practices in technology-driven knowledge management</p><p>6. Leveraging Generative AI for automated content creation, summarization, and</p><p>personalizing learning experiences</p><p>Specific courses required for project execution:</p><p>1. Software Engineering or Web Development</p><p>2. Database Management Systems</p><p>3. Cloud Computing</p><p>4. Technical Writing or Knowledge Management</p><p>Project2</p><p>Pro}eet3</p><p>5. Generative Al (GenAl) Applications in Content Creation and Learning Management</p><p>6. Educational Technology (optional but beneficial)</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 0,
      "pgStipend": 25000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 25000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "kvenkat@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}