{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6307,
      "stationName": "Purplle - Non Tech",
      "stationCity": "Mum",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2072,
      "projectId": 3251,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Create actionable insights for a product strategy\tStreamlining Supply Chain Effeciency,\tDriving Data Driven Decision Making.,",
      "description": "<p>1. Collaborate closely with the product team to define the product roadmap</p><p>2. Analyze product performance, gather user feedback, and provide insights to drive product strategy and development</p><p>3. Conduct user research and analyze feedback to understand user needs, pain points, and potential improvements.</p><p>4. Collaborate with UX/UI teams to translate user feedback into actionable product changes.</p><p>5. Benchmark industry trends, market developments, and competitors to provide insights that inform product strategy and positioning1. Propose strategies to reduce costs and improve procedures of Inventory Management</p><p>2. Create processes to ensure that all sourcing leads are meeting their personal performance standards</p><p>3. Analyze Demand and share buying projections with brand as per targets</p><p>4. Evaluate and share brand's performance scorecard periodically</p><p>5. Create and share dock hit projections, and execute dock hit plans accordingly to ensure minimum deviation from the plan6.</p><p>6. Take the lead in creating profitable ways to manage obsolete and slow-moving stock to help offset losses1. Own the development and maintenance of new and existing artifacts focused on analysis of requirements, metrics, and reporting dashboards.</p><p>2. Work on various long term projects related to beauty category and periodically asses performance metrics like conversion, supply gaps</p><p>3. Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format.</p><p>4. Work with the category leaders across skincare/makeup/haircare/personal care to drive identification of requirements and create a detailed business analysis, outlining</p><p>problems, opportunities, and solutions.1. Partner with the Sr. Key Account Managers to create a joint business plan with the key accounts</p><p>2. Formulate and implement frameworks and strategies to manage inventory levels, manage deal prices across brands &amp; participation in marketing events</p><p>3. Find whitespaces in the marketing opportunities on the various marketplaces to drive visibility &amp; sales growth</p><p>4. Ideate strategies and initiatives to grow brands and categories.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 50000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 50000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ankur.pachauri@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}