{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5592,
      "stationName": "Goodera - CSM",
      "stationCity": null,
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 945,
      "projectId": 1746,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Project - CSM analytics",
      "description": "<p>Intern</p><p>Bangalore, Volunteering-Global</p><p>JOB DESCRIPTION</p><p>As an Intern - Client Engagement you will:</p><p>1. Support the Client Engagement Team in managing client accounts.</p><p>2. Collaborate with internal teams to understand and execute on client project goals and objectives.</p><p>3. Communicate with clients to understand their needs and expectations and build and maintain strong relationships with them.</p><p>4. Take ownership of client projects from initiation to completion, ensuring that projects are delivered on time, within scope, and</p><p>within budget.</p><p>5. Contribute to the development of project plans and timelines.</p><p>6. Collaborate with team members to ensure that project deliverables meet or exceed client expectations.</p><p>7. Conduct qualitative and quantitative research to support client project objectives.</p><p>8. Draft client communications including project updates and proposals.</p><p>9. Organize client meetings and presentations.</p><p>EXPERTISE AND QUALIFICATIONS</p><p>1. A relevant Bachelor's or Master's degree</p><p>2. Passion for social impact and belief in the impact that can be delivered by purpose-led engagement of the workforce</p><p>3. Strong analytical abilities, both quantitative and qualitative</p><p>4. Exceptional articulation skills (written and verbal) to present - ideas, approaches and solutions</p><p>5. Bias for action, high energy, perseverance, low ego and boundary less behaviour to propel the team and organization forward</p><p>6. A strong work ethic and the ability to work autonomously</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 35000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ashish.narang@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}