{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 4894,
      "stationName": "D. E. Shaw India Private Limited - Project 2,Hyderabad",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 2264,
      "projectId": 3499,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Software Developer Intern - Front Office Tech",
      "description": "<p>Software Developer Intern - Front Office Tech</p><p><br></p><p>The D. E. Shaw group is a global investment and technology</p><p>development firm with more than $60 billion in investment capital as of</p><p>June 1, 2024, and offices in North America, Europe, and Asia. Since our</p><p>founding in 1988, our firm has earned an international reputation for</p><p>successful investing based on innovation, careful risk management, and</p><p>the quality and depth of our staff. We have a significant presence in the</p><p>world’s capital markets, investing in a wide range of companies and</p><p>financial instruments in both developed and developing economies.</p><p><br></p><p>Technology is an integral part of virtually everything we do, and our</p><p>team enjoys access to some of the most advanced computing resources</p><p>in the world. The technology teams work on a variety of projects ranging</p><p>from the firm's diversified strategies, trading systems, portfolio</p><p>management and visualization platforms, quantitative analysis tools,</p><p>real-time financial data-feed infrastructure, high-performance low-</p><p>latency middleware systems, or workflow tools to making talent</p><p>functions more efficient and effective. Successful candidates have</p><p>traditionally been the top students in their programs and have extensive</p><p>software development knowledge.</p><p><br></p><p>WHAT YOU WILL DO DAY-TO-DAY:</p><p>• Gain profound insights into the financial domain, developing a</p><p>comprehensive understanding of the industry</p><p>• Acquire an end-to-end understanding of trading systems workflow</p><p>while actively contributing to the development of core trading</p><p>systems components</p><p><br></p><p>• Design and implement scalable, real-time software that meets the</p><p>demanding requirements of the financial industry</p><p><br></p><p>WHO WE ARE LOOKING FOR:</p><p><br></p><p>The ideal candidate should-</p><p>Basic qualifications:</p><p><br></p><p>- Be a final year student with a minimum of CGPA of 7.00 in</p><p>computer science branches and 8.00 in circuit branches with no</p><p>current backlogs</p><p>- Have excellent problem solving and analytical skills as well as a</p><p>demonstrated passion for technology</p><p>- Demonstrate proficiency in any programming language like</p><p>C/C++/Java/Python</p><p>- Have a practical understanding of the key CS concepts like Data</p><p>structure and algorithms, Operating Systems, Computer</p><p>Networks, Database Management Systems</p><p>- Have excellent problem-solving and logical reasoning</p><p><br></p><p>We encourage candidates with relevant experience looking to restart</p><p>their careers after a break to apply for this position. Learn</p><p>about Recommence, our gender-neutral return-to-work initiative.</p><p><br></p><p>The Firm offers excellent benefits, a casual, collegial working</p><p>environment, and an attractive compensation package. For further</p><p>information about our recruitment process, including how applicant data</p><p>will be processed, please visit https://www.deshawindia.com/careers.</p><p><br></p><p>Members of the D. E. Shaw group do not discriminate in employment</p><p>matters on the basis of sex, race, colour, caste, creed, religion,</p><p><br></p><p>pregnancy, national origin, age, military service eligibility, veteran</p><p>status, sexual orientation, marital status, disability, or any other</p><p>protected class.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 250000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 250000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ambatipudi.v@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}