{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5971,
      "stationName": "CyfrOne",
      "stationCity": "Hyd",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1568,
      "projectId": 2623,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "OASIS Software Product Development",
      "description": "<p>Description: OASIS is an integrated restaurant management SaaS that addresses the core industry</p><p>problems to maximize sales and optimize costs across the value chain of restaurants and cafes. The</p><p>product focusses on the business owner&amp;#39;s perspective enhancing customer experience, reducing</p><p>people dependency and streamlining processes along with generating intelligent and actionable</p><p>insights for different user groups of the product.</p><p>You will be working as an intern in the close-knit and lean team responsible for shipping the MVP of</p><p>OASIS.</p><p>Skill sets: C# .NET (Most preferred) / Java / Node js, React/Angular, Database Handling, Web</p><p>Application development, DSA, Problem solving, Debugging, REST APIs, Clean Code</p><p>Bonus skillsets: Fullstack development, Understanding of UX/UI Design (Figma)</p><p>Traits expectation: Ownership, Self-driven, Ability to learn and implement new technologies in an</p><p>agile environment, Eager to Solve Challenging problems, Adaptive to Fast paced startup environment,</p><p>previously worked on industry level short-term projects</p><p>Expected learning: As part of the OASIS team, you will get extensive exposure to and practical</p><p>learnings related to Software Architecture, Backend development, Testing, Deployment, Fullstack</p><p>development, Product development, Direct learning and interaction with Founders, Building enterprise</p><p>products from ground up, Azure Cloud</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 40000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 40000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}