{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6499,
      "stationName": "Ather Energy",
      "stationCity": null,
      "businessDomain": "Electronics",
      "problemBankId": 2453,
      "projectId": 3717,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "1 Ride Experience Analyst Intern, 2 Product Analyst- Intern, 3 ",
      "description": "<p>Title: Ride Experience Analyst Intern</p><p>Description: YOU’LL BE BASED AT: IBC Knowledge Park, Bengaluru</p><p>YOU’LL BE ALIGNED WITH: Senior Product Manager- Ride experience</p><p>YOU’LL BE A MEMBER OF: Product Management (Vehicles &amp; Ecosystem)</p><p>WHAT YOU’LL DO AT ATHER:</p><p>This role is for an intern-analyst who would take care of validating user VoC and test</p><p>market</p><p>fit for existing and upcoming ride experiences on electric two wheelers and provide PoCs</p><p>of</p><p>solutions for improving customer experience of these experiences.</p><p>? Extensive market research to understand customer feedback and competition</p><p>benchmarking of various ride assist features on Ather two wheelers.</p><p>? Track data and create dashboards to monitor metrics for usage, quality, visibility and</p><p>thus sellability of features.</p><p>? Leverage data to classify users and create various user profiles to understand profile</p><p>based feature usage behaviour.</p><p>? Envision the future of these smart ride experience features to establish a stronger</p><p>product market fit.</p><p>? Translate product requirements into technical specifications for development by</p><p>Engg teams and verify that the requirements have been translated properly.</p><p>? Engage in prototype building and work through PoC’s to deliver on improved</p><p>experiences.</p><p>? Pitch the improved experience to various stakeholders in the company and create</p><p>buy-through for prioritization and on-field deployment of these experiences.</p><p>? Define and solve problems from first principles.</p><p>? Work with hardware, firmware, various domains of data and software engineers.</p><p>? Further work with product and senior product managers to envision future ride</p><p>experiences of Ather.</p><p>HERE’S WHAT WE ARE LOOKING FOR:</p><p>? Solid understanding of two wheeler riding</p><p>? Solid understanding of IoT systems, user research and data analytics</p><p>? Ability to read C code and write SQL scripts.</p><p>? Ability to create structured narratives and product pitch documents</p><p>? A good team player with interpersonal planning and good communication</p><p>skills.</p><p>Title: Product Analyst- Intern</p><p>Description:</p><p>YOU’LL BE BASED AT: IBC Knowledge Park, Bengaluru</p><p>YOU’LL BE ALIGNED WITH: Product Line Manager</p><p>YOU’LL BE A MEMBER OF: Product Management (Vehicles &amp; Ecosystem)</p><p>WHAT YOU’LL DO AT ATHER:</p><p>This role is for an intern-analyst who would envision and build PoC’s for future user</p><p>experiences for performance/sport two wheelers at Ather.</p><p>? Extensive market research across industries to understand needs and wants of</p><p>performance/sport users of two wheelers globally.</p><p>? Analyse data of sport user based features in Ather vehicles currently and combine</p><p>those insights with market research to develop hypothesis for future experiences</p><p>? Conduct small scale user researches to validate the hypothesis before putting</p><p>across PRD (product requirement document)</p><p>? Translate product requirements into technical specifications for development by</p><p>Engg teams and verify that the requirements have been translated properly.</p><p>? Engage in prototype building and work through PoC’s to deliver on these future</p><p>experiences</p><p>? Pitch the new experience to various stakeholders in the company and create</p><p>buy-through for prioritization and PoC building.</p><p>? Build business cases and further work on GTM (Go-to market) of these experiences</p><p>and by extension the overall vehicle.</p><p>? Define and solve problems from first principles.</p><p>? Work with hardware, firmware, various domains of data and software engineers.</p><p>HERE’S WHAT WE ARE LOOKING FOR:</p><p>? Strong ability to create structured narratives and product pitch documents</p><p>? Solid understanding of two wheeler riding and new technologies</p><p>? Good understanding of IoT systems, user research and data analytics</p><p>? Ability to write SQL scripts.</p><p>? A good team player with interpersonal planning and good communication</p><p>skills.</p><p>Title: Mechanical Engineer- Intern</p><p>Description: You’ll be based at IBC Knowledge Park, Bengaluru</p><p>You’ll be aligned with- Department of Chief Engineering</p><p>You’ll be joining our- Department of Chief Engineering</p><p>What you’ll do at Ather</p><p>? Work on the building blocks on next generation technology</p><p>? Design mechanical parts and assemblies with critical thinking on its impact</p><p>throughout the project</p><p>? Prototype rapidly and make new mistakes fast</p><p>? Iterate designs to move past ‘proof of concept’ phase quickly</p><p>Here’s what we’re looking for</p><p>? Solid CAD skills</p><p>? Mechanical prototyping skills</p><p>? Comfortable with designing for (some of the following):</p><p>¦ Machining - Turning, milling etc</p><p>¦ 3d printing</p><p>¦ Laser cutting</p><p>¦ Plastics</p><p>¦ Adhesives</p><p>? Enjoys getting hands dirty with assembling parts</p><p>? Is diligent with creating test plans and executing tests</p><p>? Math oriented - Makes decisions based on data and avoids thumb rules and</p><p>willing to learn when to use which</p><p>? Good people skills to be able to coordinate with lots of people to get stuff done</p><p>? Good to have NOT AT ALL mandatory:</p><p>? Familiarity with thermal engineering and thermal simulations</p><p>? Familiarity with embedded hardware such as simple projects on</p><p>Arduino/ESP etc</p><p>? Familiarity with crunching data with tools other than Excel</p><p>What you bring to Ather</p><p>? A fresh approach to looking at conventional problems and methodology.</p><p>? Ask and answer ‘why not this way’</p><p>? A curious mind that can ask the right questions and bring new ideas to the table.</p><p>Mechanical Engineer- Intern</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 30000,
      "pgStipend": 30000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 60000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "harish.kumar@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}