{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5055,
      "stationName": "Piramal Group - BIU,Mumbai",
      "stationCity": "Mum",
      "businessDomain": "CSIS/IT",
      "problemBankId": 1345,
      "projectId": 2331,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Business Intelligence Unit",
      "description": "<p>Data Science:</p><p>• Strong understanding of machine learning framework, advanced statistical techniques,</p><p>model design, pruning and performance optimization. Familiarity with deep Learning</p><p>framework such as TensorFlow, Keras, or PyTorch.</p><p>• High level proficiency with R, Python, SQL to extract data from multiple data sources</p><p>and combine into the required datasets for model building and drawing insights</p><p>• Collaborate with business and data engineering to identify key metrics to drive, support</p><p>with proof of concept.</p><p>• Promote data science methods and processes across organization</p><p>Data Engineering:</p><p>• Familiarity with analyzing large, multi-dimensional data sets and synthesizing insights</p><p>into actionable solutions.</p><p>• High level proficiency in SQL, Python (Pandas, NumPy, Plotly, Seaborn, Matplotlib),</p><p>Spark Streaming, Pyspark. Familiarity with cloud technologies preferably AWS.</p><p>• Perform data engineering including data ingestion, data curation, data normalization</p><p>and data analytics.</p><p>• Develop &amp; construct data architectures for both structured and unstructured data.</p><p>• Deploy ML models in production with CI/CD pipelines. Model performance monitoring,</p><p>pruning and optimization.</p><p>Data Visualization:</p><p>• Design thinking and rigor to develop insightful, visually compelling, and engaging</p><p>executive &amp; operational dashboards</p><p>• High level proficiency in at least one of the visualization tools - Power BI, Tableau, Qlik,</p><p>Quicksight, D3.js</p><p>• High level proficiency in SQL, Excel VBA, Powerpoint. Familiarity with Python (Pands,</p><p>Plotly, Seaborn).</p><p>• Collaborate with data engineers, modelers, data scientists and business leaders to</p><p>provide dashboard design input and build rapid prototypes</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 75000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 75000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "ankur.pachauri@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}