{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 6352,
      "stationName": "Quinbay technologies",
      "stationCity": null,
      "businessDomain": "CSIS/IT",
      "problemBankId": 2208,
      "projectId": 3425,
      "semesterId": 2,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Job Title: Software Development Engineer (SDE) Intern",
      "description": "<p><br></p><p>Job Overview:</p><p>We are seeking a skilled and innovative Software Development Engineer to join our dynamic team.</p><p>As an SDE, you will be responsible for designing, developing, and maintaining software applications</p><p><br></p><p>that drive our products and services. You will work in an agile environment, collaborating with cross-</p><p>functional teams to deliver high-quality solutions that meet business objectives and enhance the</p><p><br></p><p>user experience.</p><p>Key Responsibilities:</p><p>• Design, Develop, and Test Software: Build scalable, reliable, and efficient software solutions</p><p>using modern programming languages and frameworks.</p><p>• Collaborate with Teams: Work closely with product managers, designers, and other</p><p>engineers to understand requirements and translate them into high-quality code.</p><p>• Code Reviews and Testing: Participate in code reviews and ensure best practices in software</p><p>development are followed. Write unit tests and perform debugging to ensure software</p><p>quality.</p><p>• Optimize Performance: Identify bottlenecks and improve performance of existing software</p><p>systems to ensure scalability and reliability.</p><p>• Continuous Improvement: Stay updated with the latest industry trends, tools, and</p><p>technologies, and incorporate them into your work to improve the development process.</p><p>• Problem-Solving: Tackle complex technical challenges by analyzing problems and creating</p><p>effective solutions.</p><p>Qualifications:</p><p>• Educational Background: Bachelor’s degree in Engineering, or related field.</p><p>• Proficiency in Programming: Strong knowledge of programming languages such as Python,</p><p>JavaScript, etc and web technologies such as React, Typescript, Websockets, etc.</p><p>• Software Design Principles: Understanding of object-oriented programming, software design</p><p>patterns such as MVC, etc and data structures.</p><p>• Database Knowledge: Experience working with relational databases (SQL) and NoSQL</p><p>databases.</p><p>• Problem-Solving Skills: Strong analytical and problem-solving abilities, especially when</p><p>working with complex systems.</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 35000,
      "pgStipend": 35000,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 70000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "seetha.p@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}