{
  "problemBankGridLines": null,
  "projectGridLines": [
    {
      "stationId": 5882,
      "stationName": "Synergiz Global - IT",
      "stationCity": "Hyd",
      "businessDomain": "Finance and Mgmt",
      "problemBankId": 1381,
      "projectId": 2386,
      "semesterId": 1,
      "pstypeId": 2,
      "psType": "PS II",
      "batchId": 16,
      "batch": "2024-25",
      "title": "Digital Project Management Implementations in Infrastructure Projects",
      "description": "<p>Description: Synergiz Global is a Project management consultancy for large scale infrastructure</p><p>projects including Highspeed rail, metro rail and airports sector. The firm is owned by BITS alumni and</p><p>is currently managed by multiple BITSIANS. Our vision is to provide innovative project management</p><p>techniques and digital solutions to bridge the gap in our construction industry. We are currently</p><p>developing and implementing our in-house project management tools. We are planning to train you on</p><p>these tools and enhance your knowledge for the future endeavors.</p><p>Skill sets: Web and mobile application development, Javascript, CSS, MsSQL</p><p>Traits expectation: Good Communication Skills, Teamwork, Problem Solving Abilities, Analytical</p><p>thinking.</p><p>Expected learning: For IT engineers, you will Understand the digital needs in the industry and</p><p>support the project team. Support in web &amp;amp; mobile app developments. You will gain work experience</p><p>in Javascript, CSS, HTML, SQL etc. Stay ahead in the market and research new tools and methods</p><p>other activities. Learn to maintain the documentation and project data in the proper repositories.</p><p>Specific courses required for project execution: NA. (interest in web &amp;amp; mobile development</p><p>required)</p>",
      "projectDomain": "",
      "projectSubDomain": null,
      "ugStipend": 20000,
      "pgStipend": 0,
      "totalMaleRequirement": 0,
      "totalFemalRequirement": 0,
      "totalRequirment": 0,
      "discipline": "",
      "sumOfStipend": 20000,
      "createdBy": "planning@bits.com",
      "assignedFacultyEmailId": "bhamidipati.vaishali@pilani.bits-pilani.ac.in",
      "studentProjectDetails": null
    }
  ]
}